{
  "chord2idx": {
    "<PAD>": 0,
    "<UNK>": 1,
    "G": 2,
    "C": 3,
    "D": 4,
    "F": 5,
    "A": 6,
    "E": 7,
    "A#": 8,
    "D#": 9,
    "Am": 10,
    "G#": 11,
    "B": 12,
    "Em": 13,
    "C#": 14,
    "Dm": 15,
    "F#": 16,
    "Cm": 17,
    "Bm": 18,
    "Gm": 19,
    "F#m": 20,
    "Fm": 21,
    "C#m": 22,
    "D#m": 23,
    "G#m": 24,
    "A#m": 25,
    "Am7": 26,
    "Em7": 27,
    "Dm7": 28,
    "Gm7": 29,
    "Bm7": 30,
    "Cm7": 31,
    "F#m7": 32,
    "Fm7": 33,
    "G7": 34,
    "C#m7": 35,
    "Fmaj7": 36,
    "D7": 37,
    "Cmaj7": 38,
    "C7": 39,
    "A7": 40,
    "A#m7": 41,
    "D#m7": 42,
    "G#maj7": 43,
    "Dmaj7": 44,
    "G#m7": 45,
    "Gmaj7": 46,
    "E7": 47,
    "B7": 48,
    "F7": 49,
    "A#7": 50,
    "D#maj7": 51,
    "A#maj7": 52,
    "Amaj7": 53,
    "G#7": 54,
    "Bmaj7": 55,
    "F#maj7": 56,
    "C#maj7": 57,
    "Emaj7": 58,
    "D#7": 59,
    "C#7": 60,
    "F#7": 61,
    "Cunk[4,3,7]": 62,
    "Gsus4": 63,
    "Dsus4": 64,
    "Asus4": 65,
    "Funk[4,3,7]": 66,
    "Dunk[4,3,7]": 67,
    "Bdim": 68,
    "C#dim": 69,
    "Ddim": 70,
    "Aunk[4,3,7]": 71,
    "F#dim": 72,
    "Csus4": 73,
    "Edim": 74,
    "Gunk[4,3,7]": 75,
    "Fsus4": 76,
    "Esus4": 77,
    "C#sus4": 78,
    "G#dim": 79,
    "G#unk[4,3,7]": 80,
    "D#dim": 81,
    "D#unk[4,3,7]": 82,
    "Bunk[4,3,7]": 83,
    "A#sus4": 84,
    "Bsus4": 85,
    "A#unk[4,3,7]": 86,
    "G#sus4": 87,
    "C#unk[4,3,7]": 88,
    "Gdim": 89,
    "Asus2": 90,
    "Cdim": 91,
    "Dm7b5": 92,
    "Em7b5": 93,
    "Adim": 94,
    "Esus2": 95,
    "Bm7b5": 96,
    "A#dim": 97,
    "D#sus4": 98,
    "F#m7b5": 99,
    "Fdim": 100,
    "Csus2": 101,
    "Eunk[4,3,7]": 102,
    "Dsus2": 103,
    "Am7b5": 104,
    "Bsus2": 105,
    "Gsus2": 106,
    "Fsus2": 107,
    "F#sus4": 108,
    "Gunk[5,2,3]": 109,
    "F#unk[4,3,7]": 110,
    "D#sus2": 111,
    "A#sus2": 112,
    "C#sus2": 113,
    "C#m7b5": 114,
    "D#m7b5": 115,
    "Aunk[3,4,7]": 116,
    "Dunk[5,2,3]": 117,
    "Cunk[5,2,3]": 118,
    "Aunk[5,2,3]": 119,
    "Cmaj9": 120,
    "Eunk[3,4,3,4]": 121,
    "Gunk[3,4,7]": 122,
    "Dunk[2,5,3]": 123,
    "Fm7b5": 124,
    "D#unk[5,2,3]": 125,
    "Gm7b5": 126,
    "A#unk[5,2,3]": 127,
    "Bunk[5,2,3]": 128,
    "Gunk[4,3,3,4,3]": 129,
    "Funk[3,4,3,4]": 130,
    "Eunk[5,2,3]": 131,
    "Cm7b5": 132,
    "G#m7b5": 133,
    "D#unk[3,4,3,4]": 134,
    "Aunk[3,4,3,4]": 135,
    "Gunk[3,4,3,4]": 136,
    "Cunk[4,3,3,4,3]": 137,
    "D#maj9": 138,
    "G#sus2": 139,
    "G#unk[5,2,3]": 140,
    "F#unk[3,4,7]": 141,
    "A#m7b5": 142,
    "F#sus2": 143,
    "Eunk[2,5,3]": 144,
    "Fmaj9": 145,
    "Aunk[4,3,3,4,3]": 146,
    "Dunk[3,4,7]": 147,
    "A#unk[3,4,7]": 148,
    "Gunk[7]": 149,
    "Cunk[2,5,3]": 150,
    "Dunk[4,3,3,4,3]": 151,
    "Cunk[3,4,3,4]": 152,
    "Dunk[3,4,3,4,3]": 153,
    "Funk[2,5,4]": 154,
    "F#unk[5,2,3]": 155,
    "Dunk[3,4,3,4]": 156,
    "Eunk[4,3,3,4,3]": 157,
    "Gmaj9": 158,
    "Funk[3,4,7]": 159,
    "F#unk[3,4,3,4]": 160,
    "Cunk[3,4,7]": 161,
    "Dmaj9": 162,
    "F#unk[3,4,3,4,3]": 163,
    "Funk[5,2,3]": 164,
    "F#dim7": 165,
    "Cunk[3,4,3,4,3]": 166,
    "Emaj9": 167,
    "C#unk[5,2,3]": 168,
    "Aunk[3,4,3,4,3]": 169,
    "D#unk[2,5,3]": 170,
    "C#maj9": 171,
    "G#unk[3,4,3,4]": 172,
    "Bunk[3,4,3,4,3]": 173,
    "D#unk[3,4,7]": 174,
    "Eunk[3,4,3,4,3]": 175,
    "Cunk[7]": 176,
    "Cunk[2,5,4]": 177,
    "Dunk[2,5,4]": 178,
    "A#unk[4,3,3,4,3]": 179,
    "Aunk[2,5,3]": 180,
    "D#unk[2,5,4]": 181,
    "C9": 182,
    "A#unk[3,4,3,4]": 183,
    "Amaj9": 184,
    "C#dim7": 185,
    "Funk[3,4,3,4,3]": 186,
    "Bunk[4,3,3,4,3]": 187,
    "Bdim7": 188,
    "C#unk[3,4,3,4]": 189,
    "D9": 190,
    "A#unk[2,5,3]": 191,
    "Bunk[3,4,7]": 192,
    "C#unk[2,5,3]": 193,
    "Gunk[2,5,3]": 194,
    "A#maj9": 195,
    "D#unk[4,3,3,4,3]": 196,
    "Cunk[6,1]": 197,
    "F#maj9": 198,
    "G#dim7": 199,
    "G#unk[2,5,3]": 200,
    "C#unk[4,3,3,4,3]": 201,
    "G#maj9": 202,
    "Funk[4,3,3,4,3]": 203,
    "D#dim7": 204,
    "Funk[2,5,3]": 205,
    "Bunk[2,5,3]": 206,
    "Eunk[3,4,7]": 207,
    "Dunk[2,3,2]": 208,
    "Gunk[2,5,4]": 209,
    "Edim7": 210,
    "C#unk[3,4,3,4,3]": 211,
    "F9": 212,
    "Cunk[empty]": 213,
    "G#unk[3,4,7]": 214,
    "Bunk[3,4,3,4]": 215,
    "C#unk[3,4,7]": 216,
    "Gunk[2,3,2]": 217,
    "Adim7": 218,
    "Cunk[2,3,2]": 219,
    "A#unk[2,5,4]": 220,
    "Gunk[3,4,3,4,3]": 221,
    "D#unk[3,4,3,4,3]": 222,
    "G#unk[4,3,3,4,3]": 223,
    "A#unk[3,4,3,4,3]": 224,
    "A#dim7": 225,
    "Caug": 226,
    "D#9": 227,
    "G9": 228,
    "Aunk[2,5,4]": 229,
    "Fdim7": 230,
    "Bmaj9": 231,
    "Eunk[7]": 232,
    "Aunk[2,3,2]": 233,
    "Eunk[2,3,2]": 234,
    "Eunk[2,5,4]": 235,
    "Funk[6,1]": 236,
    "Gdim7": 237,
    "A9": 238,
    "F#unk[2,5,4]": 239,
    "Ddim7": 240,
    "C#unk[2,3,2]": 241,
    "Funk[2,3,2]": 242,
    "F#unk[2,5,3]": 243,
    "G#unk[2,5,4]": 244,
    "A#unk[2,3,2]": 245,
    "Bunk[2,5,4]": 246,
    "Aunk[7]": 247,
    "Cdim7": 248,
    "E9": 249,
    "A#9": 250,
    "C#unk[2,5,4]": 251,
    "B9": 252,
    "Gaug": 253,
    "Funk[empty]": 254,
    "Dunk[4,3,3,3]": 255,
    "Bunk[empty]": 256,
    "A#unk[3,4,3,7]": 257,
    "Faug": 258,
    "Daug": 259,
    "Eunk[4,3,3,3]": 260,
    "Eunk[3,4,3,7]": 261,
    "Funk[7]": 262,
    "Bunk[2,3,2]": 263,
    "F#unk[4,3,3,4,3]": 264,
    "Dunk[7]": 265,
    "F#aug": 266,
    "A#unk[empty]": 267,
    "Bunk[3,4,3,7]": 268,
    "D#aug": 269,
    "Gunk[4,3,14]": 270,
    "F#unk[2,3,2]": 271,
    "A#unk[3,3,4,3,4]": 272,
    "Aunk[4,3,10]": 273,
    "D#unk[2,3,2]": 274,
    "Eunk[4,3,14]": 275,
    "Gunk[3,4,3,7]": 276,
    "Aunk[4,3,3,3]": 277,
    "AmMaj7": 278,
    "Eaug": 279,
    "A#unk[4,3,3,4,3,4]": 280,
    "G#unk[3,4,3,4,3]": 281,
    "Dunk[empty]": 282,
    "Gunk[5]": 283,
    "D#unk[3,4,6]": 284,
    "Aunk[3,4,3,7]": 285,
    "DmMaj7": 286,
    "Bunk[7]": 287,
    "F#unk[3,4,3,7]": 288,
    "C#9": 289,
    "Cunk[5]": 290,
    "G#unk[empty]": 291,
    "Aunk[4,3,3,4,3,4]": 292,
    "Eunk[4,3,3,5]": 293,
    "G#aug": 294,
    "Bunk[4,3,3,3]": 295,
    "Gunk[6,1]": 296,
    "Baug": 297,
    "Gunk[4,3,3,4,3,4]": 298,
    "Aaug": 299,
    "D#unk[4,6]": 300,
    "Cunk[4,3,4,3,3]": 301,
    "C#unk[4,3,4,3,4]": 302,
    "Cunk[4,3,3,3]": 303,
    "A#unk[7]": 304,
    "Cunk[4,3,10]": 305,
    "C#aug": 306,
    "G#unk[3,4,3,7]": 307,
    "G#unk[2,3,2]": 308,
    "Eunk[3,3,7]": 309,
    "Gunk[3,3,4,3,4]": 310,
    "C#unk[3,4,3,7]": 311,
    "D#unk[7]": 312,
    "Dunk[4,3,14]": 313,
    "Faug7": 314,
    "Bunk[4,3,3,5]": 315,
    "Dunk[4,3,7,7]": 316,
    "Dunk[4,2,4]": 317,
    "Eunk[4,3,4,4,3,3]": 318,
    "F#unk[3,3,4,3,4]": 319,
    "Funk[4,3,14]": 320,
    "Cunk[2,3,2,3]": 321,
    "F#unk[3,4,10]": 322,
    "Bunk[1,5,4]": 323,
    "Funk[3,4,3,7]": 324,
    "Gunk[4,3,3,3]": 325,
    "Cunk[6,2]": 326,
    "A#unk[6,1]": 327,
    "Bunk[6,1]": 328,
    "Aunk[4,3,14]": 329,
    "C#unk[4,3,10]": 330,
    "Eunk[3,4,10]": 331,
    "Eunk[4,3,10]": 332,
    "C#unk[6,1]": 333,
    "Eunk[1,6,3]": 334,
    "D#unk[6,1]": 335,
    "D#unk[3,3,4,3,4]": 336,
    "G#9": 337,
    "Gunk[4,3,7,7]": 338,
    "Cunk[4,3,7,7]": 339,
    "Bunk[4,3,3,10]": 340,
    "Cunk[4,3,14]": 341,
    "Dunk[4,3,10]": 342,
    "Gunk[3]": 343,
    "Gunk[empty]": 344,
    "Funk[1,5,4]": 345,
    "Aunk[4,3,3,10]": 346,
    "Funk[4,6]": 347,
    "D#unk[4,3,10]": 348,
    "Funk[4,4,3]": 349,
    "Gunk[2,5,14]": 350,
    "F#9": 351,
    "A#unk[4,3,14]": 352,
    "A#aug": 353,
    "Bunk[4,3,3,4,3,4]": 354,
    "Cunk[3,4,3,7]": 355,
    "Aunk[empty]": 356,
    "G#unk[7]": 357,
    "C#unk[empty]": 358,
    "CmMaj7": 359,
    "Aunk[3,4,10]": 360,
    "D#unk[5,2,4]": 361,
    "Eunk[6,1]": 362,
    "Dunk[5,2,4]": 363,
    "FmMaj7": 364,
    "Gunk[3,4,10]": 365,
    "BmMaj7": 366,
    "Gunk[1,6,3]": 367,
    "Aunk[6,1]": 368,
    "Dunk[3,4,3,3,4]": 369,
    "F#unk[4,3,3,3]": 370,
    "Aunk[4,2,4]": 371,
    "Cunk[5,2,3,4]": 372,
    "Dunk[4,3,3,5]": 373,
    "D#unk[empty]": 374,
    "Cunk[4,4,3]": 375,
    "Cunk[4,3,4,4,3]": 376,
    "Bunk[5,2,3,4]": 377,
    "C#unk[4,17]": 378,
    "Eunk[3]": 379,
    "A#unk[4,4,3]": 380,
    "F#unk[7]": 381,
    "Gunk[4,4,3]": 382,
    "Bunk[3,4,10]": 383,
    "Bunk[4,3,10]": 384,
    "Gunk[3,4,3,3,4]": 385,
    "Gunk[4,3,3,10]": 386,
    "Dunk[2,4,1]": 387,
    "Eunk[3,3,4,3,4]": 388,
    "G#unk[4,3,4,3,4]": 389,
    "Bunk[3,3,4,3,4]": 390,
    "Aunk[3,3,4,3]": 391,
    "Gaug7": 392,
    "D#mMaj7": 393,
    "F#unk[empty]": 394,
    "C#unk[4,3,3,3]": 395,
    "Aunk[2,4,1]": 396,
    "Dunk[6,1]": 397,
    "F#unk[5,1]": 398,
    "Funk[4,3,4,10]": 399,
    "F#unk[4,3,3,4,3,4]": 400,
    "D#unk[4,3,3,3]": 401,
    "G#unk[4,3,14]": 402,
    "Gunk[3,4,14]": 403,
    "GmMaj7": 404,
    "D#unk[3,4,3,7]": 405,
    "F#unk[4,17]": 406,
    "F#unk[3,4,6]": 407,
    "C#unk[3,4,3,3,4]": 408,
    "Aunk[3,4,3,3]": 409,
    "Baug7": 410,
    "Funk[4,3,3,11]": 411,
    "Cunk[4,3,6]": 412,
    "Aunk[3]": 413,
    "Dunk[3]": 414,
    "Aunk[4,3,7,7]": 415,
    "C#unk[3,4,10]": 416,
    "Gunk[4,3,10]": 417,
    "F#unk[4,3,10]": 418,
    "D#unk[4,4,3]": 419,
    "Funk[4,3,4,7]": 420,
    "F#aug7": 421,
    "Dunk[3,4,3,7]": 422,
    "Cunk[4,3,11]": 423,
    "Aunk[4,3,3,11]": 424,
    "Gunk[4,3,4,10]": 425,
    "Bunk[7,7]": 426,
    "Funk[4,3,3,8]": 427,
    "Eunk[5,2,3,4]": 428,
    "Gunk[5,2,4]": 429,
    "Dunk[1,6,3]": 430,
    "Funk[4,3,3,3]": 431,
    "Funk[4]": 432,
    "Cunk[2,3,2,4]": 433,
    "G#unk[4,3,3,3]": 434,
    "Funk[4,3,10]": 435,
    "Dunk[3,4,10]": 436,
    "C#unk[7]": 437,
    "Cunk[7,4]": 438,
    "A#unk[4,3,3,10]": 439,
    "G#unk[4,3,4,3,4,3]": 440,
    "G#unk[6]": 441,
    "Cunk[7,7]": 442,
    "G#unk[6,1]": 443,
    "Gunk[4,3,4,3,4]": 444,
    "Cunk[2,4,1]": 445,
    "Aaug7": 446,
    "Bunk[4,3,14]": 447,
    "Eunk[empty]": 448,
    "Gunk[2,3,2,3]": 449,
    "Dunk[4,2]": 450,
    "Bunk[7,3]": 451,
    "G#unk[3,4,14]": 452,
    "Eunk[4,3,3,10]": 453,
    "A#unk[3,4,10]": 454,
    "G#mMaj7": 455,
    "F#unk[4,3,3,3,7]": 456,
    "F#unk[3,4,3,10]": 457,
    "Cunk[4,3,3,10]": 458,
    "Bunk[4,3,4,7]": 459,
    "Bunk[3,3,5]": 460,
    "Aunk[7,7]": 461,
    "Aunk[5,2,4]": 462,
    "Gunk[3,4,6]": 463,
    "Dunk[1,5,4]": 464,
    "Dunk[3,3,7]": 465,
    "Eunk[3,4,3,3]": 466,
    "Bunk[3,4,3,3,4]": 467,
    "Dunk[3,3,4,3,4]": 468,
    "G#unk[1,5,4]": 469,
    "Gunk[4,3,4,3,3]": 470,
    "A#mMaj7": 471,
    "Eunk[3,4,14]": 472,
    "C#mMaj7": 473,
    "D#unk[3,4,14]": 474,
    "A#unk[4,3,11]": 475,
    "Bunk[4,3,11]": 476,
    "G#unk[10]": 477,
    "D#unk[4,3,7,7]": 478,
    "F#unk[4,3,3,5]": 479,
    "A#unk[4,3,7,7]": 480,
    "G#unk[4,3,3,4,3,4]": 481,
    "Dunk[4,3,4,3,3,3]": 482,
    "A#unk[4,3,4,10]": 483,
    "D#unk[4,3,3,11]": 484,
    "Aunk[2,3,2,4]": 485,
    "Funk[6,1,4]": 486,
    "F#unk[2,4,1]": 487,
    "Funk[4,3,4,3,4]": 488,
    "G#unk[3,4,3,3,4]": 489,
    "D#unk[4,3,4,3,4]": 490,
    "A#unk[4,3,4,3,4]": 491,
    "Dunk[4,3,4,3,3]": 492,
    "Bunk[3,4,3,3]": 493,
    "Gunk[1,5,4]": 494,
    "F#mMaj7": 495,
    "Funk[4,3,3,5]": 496,
    "Aunk[4,3,3,5]": 497,
    "G#unk[4,2,4]": 498,
    "Caug7": 499,
    "A#unk[4]": 500,
    "Gunk[4,3,3,3,4,4]": 501,
    "F#unk[4,3,3,10]": 502,
    "Cunk[4,3,3,5]": 503,
    "D#unk[4,3,11]": 504,
    "G#unk[4,3,7,7]": 505,
    "Eunk[4,3,8,6]": 506,
    "Aunk[4,3,11]": 507,
    "A#unk[4,3,3,11]": 508,
    "Gunk[4,7]": 509,
    "D#unk[6,1,4]": 510,
    "Funk[2,4,1]": 511,
    "Aunk[5,1,4]": 512,
    "G#unk[6,1,4]": 513,
    "Funk[3,4,6]": 514,
    "Cunk[1,6,3]": 515,
    "D#unk[3,3,7]": 516,
    "Eunk[5,2,4]": 517,
    "C#unk[5,1]": 518,
    "F#unk[6,1]": 519,
    "A#unk[1,5]": 520,
    "A#unk[2,4,1]": 521,
    "Cunk[6,1,4]": 522,
    "D#unk[5,1,4]": 523,
    "F#unk[5,2,4]": 524,
    "Eunk[3,4,3,3,4]": 525,
    "A#aug7": 526,
    "Daug7": 527,
    "C#unk[4,3,3,4,4]": 528,
    "Gunk[4]": 529,
    "Bunk[3]": 530,
    "D#unk[4,3,14]": 531,
    "G#unk[2,3,2,3]": 532,
    "Aunk[2,3,2,3]": 533,
    "Eunk[7,3]": 534,
    "F#unk[11]": 535,
    "Aunk[3,4,3,7,3]": 536,
    "Eunk[4,3,3,5,5]": 537,
    "C#unk[3,7]": 538,
    "Gunk[4,3,3,7]": 539,
    "Aunk[4,3,3,3,7]": 540,
    "A#unk[2,3,2,3,11]": 541,
    "A#unk[4,3,3,3,7]": 542,
    "Aunk[4,3,3,4,7]": 543,
    "Dunk[7,3]": 544,
    "Funk[4,3,11]": 545,
    "Funk[5,2,7]": 546,
    "Gunk[3,3,5]": 547,
    "Eunk[7,7]": 548,
    "Dunk[4,3,11,3]": 549,
    "Funk[5,1,4]": 550,
    "Eunk[5,1]": 551,
    "Bunk[2,4,1]": 552,
    "Funk[4,3,4,3,3]": 553,
    "Aunk[1,5,4]": 554,
    "C#unk[1,6]": 555,
    "Eaug7": 556,
    "Dunk[5,2,3,4]": 557,
    "G#unk[4,3,3,11]": 558,
    "Aunk[3,4,14]": 559,
    "C#unk[4,4,3]": 560,
    "Dunk[4,3,3,10]": 561,
    "D#unk[3,4,10]": 562,
    "Eunk[3,4,3,7,3]": 563,
    "Cunk[4]": 564,
    "A#unk[4,3,3,3]": 565,
    "Cunk[3,4,14]": 566,
    "Aunk[4,2]": 567,
    "Dunk[7,4]": 568,
    "Dunk[3,4,3,4,3,4]": 569,
    "A#unk[4,3,4,7]": 570,
    "Dunk[4,3,3,7]": 571,
    "G#unk[7,4,4,3]": 572,
    "Bunk[4,3,3,11]": 573,
    "Gunk[4,2,4]": 574,
    "Aunk[4,3,3,7]": 575,
    "C#unk[4,3,3,10]": 576,
    "Aunk[4,3,3,5,5]": 577,
    "Dunk[3,7]": 578,
    "A#unk[2,3,5]": 579,
    "Funk[4,3,3,4,3,4]": 580,
    "Cunk[4,3,4,3,7]": 581,
    "Bunk[4,3,4,10]": 582,
    "Bunk[3,4,3,4,4,3]": 583,
    "D#unk[7,3,4]": 584,
    "Eunk[4,6,4]": 585,
    "D#unk[5,2,3,4]": 586,
    "Eunk[3,5]": 587,
    "Bunk[5,1,4]": 588,
    "Gunk[6,1,4]": 589,
    "A#unk[5,2,4]": 590,
    "Eunk[6,1,4]": 591,
    "Gunk[2,4,1]": 592,
    "Eunk[4,3,4,3,3]": 593,
    "Aunk[3,4,3,3,4]": 594,
    "Eunk[3,4,6]": 595,
    "A#unk[3,4,3,3]": 596,
    "Aunk[3,3,4,3,4]": 597,
    "G#unk[5,2,4]": 598,
    "Funk[3,3,4,3,4]": 599,
    "C#unk[4,3,14]": 600,
    "Aunk[3,3,4,10]": 601,
    "Aunk[4,3,4,10]": 602,
    "Aunk[5,2,3,4,7]": 603,
    "A#unk[4,3,3,5]": 604,
    "Bunk[3,7]": 605,
    "EmMaj7": 606,
    "Dunk[2,3,2,3]": 607,
    "Funk[4,3,4,3,4,3]": 608,
    "D#unk[7,3]": 609,
    "Dunk[4]": 610,
    "Funk[11]": 611,
    "Funk[3,4,3,7,3]": 612,
    "G#unk[4,4,3]": 613,
    "C#unk[4,3,3,4,3,4]": 614,
    "F#unk[3,4,14]": 615,
    "A#unk[4,7]": 616,
    "Aunk[5,2,3,11]": 617,
    "G#unk[3,7]": 618,
    "Gunk[4,2]": 619,
    "Dunk[4,3,3,4,3,4]": 620,
    "Aunk[3,3,4,7,3]": 621,
    "Gunk[4,3,10,4]": 622,
    "Eunk[2,3,2,4]": 623,
    "A#unk[2,3,2,3]": 624,
    "Cunk[4,3,3,11]": 625,
    "D#unk[4,3,4,3,7]": 626,
    "C#unk[2,4,1]": 627,
    "Cunk[3,3,7]": 628,
    "Eunk[5,1,4]": 629,
    "Bunk[1,6,3]": 630,
    "Eunk[1,6]": 631,
    "Funk[1,6,3]": 632,
    "Dunk[4,3,4,3,4]": 633,
    "Cunk[1,5,4]": 634,
    "Funk[3,4,3,3,4]": 635,
    "F#unk[4,4,3]": 636,
    "Eunk[1,5,4]": 637,
    "Cunk[4,3,4,7]": 638,
    "Bunk[4,4,2,5]": 639,
    "Eunk[4,4,2,5]": 640,
    "Aunk[3,7]": 641,
    "Dunk[5,5]": 642,
    "Bunk[4,3,3,5,5]": 643,
    "Bunk[4,4,3]": 644,
    "Aunk[3,5,2]": 645,
    "G#unk[5,2,3,11]": 646,
    "Cunk[4,2,5]": 647,
    "D#unk[3,4,13]": 648,
    "Gunk[4,3,6]": 649,
    "Cunk[3,4,7,3]": 650,
    "Eunk[7,3,4]": 651,
    "Eunk[4,3,7,7]": 652,
    "G#unk[8]": 653,
    "A#unk[4,3,10]": 654,
    "G#unk[4,3,11]": 655,
    "Aunk[5]": 656,
    "Eunk[3,3,11,4]": 657,
    "Bunk[3,4,3,4,3,3]": 658,
    "G#unk[4,3,3,10]": 659,
    "Bunk[4,3,3,3,7]": 660,
    "Eunk[4,4,3]": 661,
    "Funk[4,3,7,7]": 662,
    "G#unk[4,3,8]": 663,
    "G#unk[4,3,4,7]": 664,
    "Aunk[4,3,7,3]": 665,
    "Gunk[7,3]": 666,
    "Gunk[3,4,3,10]": 667,
    "A#unk[3,4,14]": 668,
    "Eunk[4,3,3,11]": 669,
    "Dunk[4,3,3,3,7]": 670,
    "G#unk[4,3,4,3,3,3]": 671,
    "Cunk[3,4,3,10]": 672,
    "Funk[4,3,3,10]": 673,
    "C#unk[4,3,3,5]": 674,
    "Eunk[6,1,3]": 675,
    "A#unk[1,3,2]": 676,
    "Dunk[2,3,2,4]": 677,
    "C#unk[4,3,3,4,7]": 678,
    "Gunk[4,3,3,11]": 679,
    "Eunk[4,3,3,7]": 680,
    "Gunk[7,7]": 681,
    "F#unk[7,3,4]": 682,
    "Aunk[2,5,4,8]": 683,
    "Aunk[4,3,4,3,5,2]": 684,
    "Aunk[3,5,3]": 685,
    "F#unk[3,3,7]": 686,
    "Cunk[5,2,4]": 687,
    "Bunk[5,1]": 688,
    "Aunk[3,3,7]": 689,
    "C#unk[3,3,7]": 690,
    "F#unk[1,6,3]": 691,
    "Gunk[3,3,7]": 692,
    "Aunk[6,1,4]": 693,
    "Bunk[5,2,4]": 694,
    "Aunk[4,3,4,3,3]": 695,
    "Aunk[3,4,6]": 696,
    "Funk[3,4,3,3]": 697,
    "Bunk[1,6]": 698,
    "D#unk[3,4,3,10]": 699,
    "D#unk[1,5,4]": 700,
    "C#unk[6,4]": 701,
    "Cunk[4,3,4,10]": 702,
    "F#unk[4,3,3,11]": 703,
    "C#unk[3,4,14]": 704,
    "Eunk[3,4,13]": 705,
    "D#unk[4,2,4]": 706,
    "Gunk[2,3,2,3,11]": 707,
    "C#unk[4,3,3,3,4,4]": 708,
    "Aunk[4,4,3]": 709,
    "G#unk[4,3,3,5]": 710,
    "Bunk[4,2,4]": 711,
    "Cunk[3,4,10]": 712,
    "D#unk[4,3,3,4,3,4]": 713,
    "Bunk[5,5]": 714,
    "D#unk[7,4]": 715,
    "Dunk[4,7,3]": 716,
    "Cunk[4,3,4,3,3,4]": 717,
    "Dunk[3,4,3,3]": 718,
    "F#unk[4,2]": 719,
    "F#unk[4,3,4,7]": 720,
    "Bunk[4,3,3,7]": 721,
    "C#unk[4,3,3,3,7]": 722,
    "Cunk[4,3,3,4,3,4]": 723,
    "G#unk[4,3,4,10]": 724,
    "G#aug7": 725,
    "Aunk[3,3,11,4]": 726,
    "Eunk[3,4,3,4,3,3]": 727,
    "Eunk[3,7]": 728,
    "Cunk[4,3,3,5,5]": 729,
    "C#unk[4,3,3,8]": 730,
    "F#unk[4,2,4]": 731,
    "Gunk[4,3,4,3,3,3]": 732,
    "Eunk[4,6]": 733,
    "Cunk[4,3,3,7]": 734,
    "Funk[3,4,7,4]": 735,
    "Eunk[4,3,4,7]": 736,
    "Gunk[1,6]": 737,
    "G#unk[4,3,8,3]": 738,
    "C#unk[2,3,2,3]": 739,
    "Eunk[4,3,4,10]": 740,
    "Bunk[1,4,2,3]": 741,
    "Eunk[4,3,3,4,3,4]": 742,
    "Cunk[4,3,7,3]": 743,
    "G#unk[4,3,3,8]": 744,
    "Gunk[4,3,4,3,4,3]": 745,
    "F#unk[2,3,2,4]": 746,
    "D#unk[4,3,3,10]": 747,
    "Funk[5,2,3,4]": 748,
    "Dunk[3,4,14]": 749,
    "C#unk[1,4,1,4,11]": 750,
    "Dunk[3,4,7,7]": 751,
    "Funk[4,4,2,3]": 752,
    "G#unk[5,2,3,4]": 753,
    "C#unk[3,5,2]": 754,
    "F#unk[5,2,3,4]": 755,
    "Eunk[10,3,4]": 756,
    "A#unk[3,4,6]": 757,
    "Cunk[3,4,6]": 758,
    "Funk[3,3,7]": 759,
    "C#unk[1,6,3]": 760,
    "G#unk[2,4,1]": 761,
    "Aunk[4,3,4,3,4]": 762,
    "Dunk[5,1,4]": 763,
    "D#unk[3,4,3,3,4]": 764,
    "Cunk[4,3,4,3,4]": 765,
    "F#unk[3,4,3,3]": 766,
    "D#unk[4,3,4,3,3]": 767,
    "Eunk[3,3,4,3]": 768,
    "F#unk[1,5,3]": 769,
    "G#unk[1,6,3]": 770,
    "G#unk[4,6]": 771,
    "Eunk[4,3,3,4,4]": 772,
    "A#unk[4,3,3,4,4]": 773,
    "C#unk[4,2,4,4]": 774,
    "F#unk[5,1,4]": 775,
    "Bunk[3,4,14]": 776,
    "F#unk[1,5,4]": 777,
    "Cunk[4,6]": 778,
    "Funk[2,3,2,3]": 779,
    "Aunk[4,6]": 780,
    "Funk[7,3]": 781,
    "Eunk[3,4,3,7,4]": 782,
    "D#unk[4,3,3,5]": 783,
    "Dunk[3,3,3,11]": 784,
    "G#unk[4,3,10]": 785,
    "C#aug7": 786,
    "A#unk[4,3,3,8]": 787,
    "Cunk[3,7]": 788,
    "Eunk[4]": 789,
    "D#unk[4,3,4,7]": 790,
    "Cunk[3,3,4,3,4]": 791,
    "Aunk[4,10]": 792,
    "G#unk[3,4,10]": 793,
    "Cunk[7,14]": 794,
    "Bunk[10,9]": 795,
    "Aunk[14,3]": 796,
    "Cunk[4,3,4,3,3,3]": 797,
    "Gunk[11]": 798,
    "Bunk[3,3,3,4,3]": 799,
    "Cunk[4,2,4]": 800,
    "A#unk[3,3,3,4,3]": 801,
    "A#unk[2,5,10]": 802,
    "C#unk[3,4,3,10]": 803,
    "F#unk[3,2]": 804,
    "Cunk[3,3,3,4,3]": 805,
    "F#unk[3]": 806,
    "Gunk[4,4,2,4]": 807,
    "C#unk[4,3,4,7]": 808,
    "A#unk[7,3,4,4]": 809,
    "Gunk[3,4,7,3]": 810,
    "Gunk[3,3,3,4,3]": 811,
    "G#unk[5,2,4,2]": 812,
    "Dunk[4,3,6]": 813,
    "Bunk[4,3,4,3,4]": 814,
    "Gunk[2,3,2,4]": 815,
    "Bunk[7,4]": 816,
    "Gunk[4,3,3,8]": 817,
    "Gunk[4,3,3,3,7]": 818,
    "Cunk[3]": 819,
    "Funk[4,3,4,4,3]": 820,
    "Funk[3,4,14]": 821,
    "Cunk[7,3]": 822,
    "C#unk[1,5,3]": 823,
    "Eunk[4,4,6]": 824,
    "Aunk[3,4,7,3]": 825,
    "G#unk[4,3,4,3,7]": 826,
    "Dunk[2,3,2,3,11]": 827,
    "Aunk[5,2,3,4]": 828,
    "C#unk[5,2,3,4]": 829,
    "Eunk[2,3,2,3,11]": 830,
    "Dunk[4,3,3,4,7]": 831,
    "A#unk[4,2]": 832,
    "C#unk[3,3,4,10]": 833,
    "F#unk[4,3,3,8]": 834,
    "Cunk[7,4,4,3]": 835,
    "Cunk[4,4,2,5]": 836,
    "G#unk[4,2]": 837,
    "Cunk[2,3,2,3,11]": 838,
    "Aunk[4,2,4,3]": 839,
    "Eunk[4,3,8,3]": 840,
    "Eunk[1,4,2,3]": 841,
    "Eunk[4,2,4]": 842,
    "A#unk[3,4,3,10]": 843,
    "Aunk[3,4,3,10]": 844,
    "Aunk[4,3,3,4,4]": 845,
    "Gunk[4,3,7,4]": 846,
    "Aunk[4,2,8]": 847,
    "Aunk[3,3,3,11]": 848,
    "F#unk[7,3]": 849,
    "G#unk[4,2,5]": 850,
    "Aunk[4,3,4,8]": 851,
    "Bunk[4,13]": 852,
    "F#unk[7,3,4,4]": 853,
    "Bunk[7,3,10]": 854,
    "Cunk[7,4,4]": 855,
    "Cunk[6]": 856,
    "A#unk[3,3,5]": 857,
    "A#unk[5,3]": 858,
    "Dunk[7,4,3]": 859,
    "A#unk[7,4,3]": 860,
    "Aunk[7,3,4]": 861,
    "Cunk[4,3,4,8]": 862,
    "Aunk[1,6,3]": 863,
    "Dunk[1,5]": 864,
    "A#unk[1,5,4]": 865,
    "Aunk[1,4,2]": 866,
    "C#unk[5,2,4]": 867,
    "A#unk[3,3,4,3]": 868,
    "Eunk[2,4,1]": 869,
    "Eunk[4,3,4,3,4]": 870,
    "Cunk[1,5]": 871,
    "Cunk[3,4,3,3,4]": 872,
    "Bunk[3,3,4,3]": 873,
    "Gunk[4,4,2,3]": 874,
    "C#unk[4,2,4]": 875,
    "C#unk[4,3,4,10]": 876,
    "Cunk[4,2]": 877,
    "C#unk[3,3,4,7]": 878,
    "G#unk[3,3,4,7]": 879,
    "Funk[3,4,4,7]": 880,
    "Bunk[3,4,6]": 881,
    "Bunk[4,6]": 882,
    "D#unk[3,4,7,3]": 883,
    "C#unk[4,3,10,4]": 884,
    "Bunk[6,1,4,10]": 885,
    "A#unk[3,4,3,3,4,3]": 886,
    "A#unk[7,3,4,3]": 887,
    "Aunk[7,3,4,3,4]": 888,
    "Cunk[4,3,3,3,4,4]": 889,
    "Gunk[7,3,4]": 890,
    "C#unk[4,3,7,7]": 891,
    "F#unk[4,3,4,3,4,3]": 892,
    "F#unk[4,2,5]": 893,
    "Eunk[4,3,4,3,4,3]": 894,
    "Aunk[7,3]": 895,
    "D#unk[3,6]": 896,
    "Funk[3,3,5]": 897,
    "Bunk[4]": 898,
    "F#unk[4,3,14]": 899,
    "Dunk[4,3,4,7]": 900,
    "Bunk[14,3]": 901,
    "Gunk[4,3,4,3,3,4]": 902,
    "A#unk[4,3,4,3,4,3]": 903,
    "Eunk[4,4,2,3]": 904,
    "Dunk[3,3,4,7]": 905,
    "Dunk[4,4,2,4]": 906,
    "Eunk[6]": 907,
    "Bunk[4,2]": 908,
    "F#unk[4,3,11]": 909,
    "Bunk[3,4,11]": 910,
    "Eunk[3,2]": 911,
    "Funk[4,3,4,3,3,3]": 912,
    "Eunk[4,3,11]": 913,
    "C#unk[2,3,2,3,10]": 914,
    "Dunk[3,5,2]": 915,
    "Funk[3,5,2]": 916,
    "G#unk[3,3,3,4,3]": 917,
    "D#unk[2,3,2,3,11]": 918,
    "Gunk[4,3,3,5]": 919,
    "D#unk[4,3,7,3]": 920,
    "G#unk[3,3,8]": 921,
    "Dunk[3,4,3,7,3]": 922,
    "Dunk[4,4,6]": 923,
    "Dunk[4,3,4,3,7]": 924,
    "Eunk[4,3,4,3,3,3]": 925,
    "Aunk[4,3,4,3,4,3]": 926,
    "Cunk[3,4,7,7]": 927,
    "Gunk[4,3,4,7]": 928,
    "Bunk[3,6]": 929,
    "Gunk[4,3,11]": 930,
    "Gunk[3,4,3,7,3]": 931,
    "A#unk[2,5,3,11]": 932,
    "Aunk[4,3,7,3,4]": 933,
    "Funk[4,3,7,4]": 934,
    "Eunk[3,3,3,4,3]": 935,
    "Dunk[3,5]": 936,
    "D#unk[4,3,3,4,4]": 937,
    "F#unk[4,3,4,10]": 938,
    "D#unk[4,3,4,3,4,3]": 939,
    "Gunk[5,2,3,4]": 940,
    "F#unk[3,7,10]": 941,
    "Funk[3,4,10]": 942,
    "F#unk[2,3,2,3,11]": 943,
    "D#unk[4,3,3,8]": 944,
    "Eunk[4,3,3,5,2,4]": 945,
    "Funk[4,3,3,4,7]": 946,
    "F#unk[3,3,4,7]": 947,
    "F#unk[3,4,11]": 948,
    "A#unk[2,3,2,4]": 949,
    "Dunk[5,2,4,10]": 950,
    "Eunk[4,3,3,4,7]": 951,
    "C#unk[3,6]": 952,
    "Funk[2,3,2,4]": 953,
    "Dunk[4,3,3,11]": 954,
    "G#unk[2,5,14]": 955,
    "Bunk[3,4,10,4]": 956,
    "Eunk[3,4,3,10]": 957,
    "Funk[5,3,2]": 958,
    "Bunk[4,3,7,7]": 959,
    "Funk[3,4,10,4]": 960,
    "C#unk[4,10,7]": 961,
    "C#unk[5,5]": 962,
    "Dunk[5,3,13]": 963,
    "C#unk[3,7,4]": 964,
    "Cunk[7,4,3]": 965,
    "Aunk[10,4,3]": 966,
    "A#unk[6,1,4]": 967,
    "A#unk[5,1]": 968,
    "D#unk[2,4,1]": 969,
    "Eunk[1,4,2]": 970,
    "D#unk[1,6]": 971,
    "Cunk[1,6]": 972,
    "Dunk[5,1]": 973,
    "Gunk[5,1,4]": 974,
    "G#unk[3,3,4,3,4]": 975,
    "F#unk[4,3,4,3,4]": 976,
    "Cunk[3,3,3,4]": 977,
    "A#unk[3,4,3,3,4]": 978,
    "Dunk[3,3,3,4]": 979,
    "G#unk[1,4,1]": 980,
    "C#unk[3,4,6]": 981,
    "Funk[5,2,4]": 982,
    "Gunk[3,4,3,3]": 983,
    "Aunk[1,6]": 984,
    "F#unk[6,1,4]": 985,
    "G#unk[1,6]": 986,
    "Aunk[1,5]": 987,
    "A#unk[1,6,3]": 988,
    "Eunk[1,5,3]": 989,
    "G#unk[3,3,7]": 990,
    "G#unk[3,4,6]": 991,
    "D#unk[7,7,7]": 992,
    "Dunk[4,3,3,3,4]": 993,
    "Bunk[3,4,3,11]": 994,
    "Aunk[3,4,4,3,3]": 995,
    "F#unk[3,5]": 996,
    "Bunk[4,2,4,4]": 997,
    "Bunk[4,3,4,3,7]": 998,
    "Eunk[3,3,5]": 999,
    "Bunk[7,3,4,3]": 1000,
    "Dunk[4,3,4,3,4,3]": 1001,
    "A#unk[4,3,6]": 1002,
    "D#unk[4,3,6]": 1003,
    "Dunk[4,3,4,10]": 1004,
    "D#unk[4,2,4,4]": 1005,
    "Gunk[4,4,2,5]": 1006,
    "Bunk[4,3,3,3,4,4]": 1007,
    "D#unk[3,4,3,11]": 1008,
    "D#unk[4]": 1009,
    "Eunk[3,3,10]": 1010,
    "Cunk[3,5,2]": 1011,
    "A#unk[3,5,2]": 1012,
    "Aunk[4,3,3,4,4,3]": 1013,
    "F#unk[5,3,3,2]": 1014,
    "Aunk[4]": 1015,
    "Eunk[3,5,2]": 1016,
    "Aunk[4,3,4,3,3,4]": 1017,
    "C#unk[6]": 1018,
    "D#unk[6,4,3]": 1019,
    "Dunk[3,4,3,7,4]": 1020,
    "Funk[4,4,13]": 1021,
    "D#unk[14,7]": 1022,
    "D#unk[11,10]": 1023,
    "Dunk[14,7]": 1024,
    "Eunk[7,4]": 1025,
    "C#unk[7,3]": 1026,
    "Funk[4,3,4,3,3,4]": 1027,
    "Aunk[2,3,2,4,9]": 1028,
    "Funk[2,3,2,4,9]": 1029,
    "Dunk[4,3,10,4]": 1030,
    "Bunk[4,4,2,3]": 1031,
    "G#unk[6,2,3]": 1032,
    "Bunk[4,3,4,3,4,3]": 1033,
    "Bunk[3,3,4,7]": 1034,
    "C#unk[4,3,4,3,4,3]": 1035,
    "Eunk[4,3,3,8]": 1036,
    "Gunk[2]": 1037,
    "Gunk[3,4,3,4,7]": 1038,
    "Bunk[2,5,10]": 1039,
    "Funk[4,4,6]": 1040,
    "D#unk[4,3,8]": 1041,
    "F#unk[3,4,3,3,4]": 1042,
    "Gunk[4,6]": 1043,
    "Dunk[4,3,4,4,5]": 1044,
    "Funk[4,2,15]": 1045,
    "Funk[4,3,3,5,5]": 1046,
    "F#unk[3,6]": 1047,
    "Gunk[3,5,13]": 1048,
    "Aunk[4,6,3]": 1049,
    "D#unk[4,3,4,10]": 1050,
    "F#unk[6,4]": 1051,
    "G#unk[2,4,4]": 1052,
    "Gunk[4,3,8]": 1053,
    "Bunk[4,3,7,3]": 1054,
    "F#unk[4,3,3,7]": 1055,
    "Bunk[3,3,7]": 1056,
    "A#unk[4,3,4,3,7]": 1057,
    "Funk[4,3,4,2]": 1058,
    "F#unk[3,3,4,4]": 1059,
    "G#unk[4,3,3,4,7]": 1060,
    "Gunk[4,3,3,5,5]": 1061,
    "C#unk[3]": 1062,
    "Funk[4,3,3,3,4,4]": 1063,
    "D#unk[2,4,1,4,10]": 1064,
    "Funk[4,3,3,7,3]": 1065,
    "Eunk[3,4,6,4]": 1066,
    "Gunk[5,6,10]": 1067,
    "G#unk[1,5,3]": 1068,
    "G#unk[5,1,5]": 1069,
    "Gunk[4,3,8,3]": 1070,
    "Dunk[4,3,3,3,5]": 1071,
    "Funk[5,2,3,11]": 1072,
    "Funk[4,3,3,7,4]": 1073,
    "Bunk[5,3,3]": 1074,
    "Funk[1,6]": 1075,
    "Dunk[6,4]": 1076,
    "G#unk[4,3,4,4]": 1077,
    "Aunk[4,4,6]": 1078,
    "Dunk[4,7]": 1079,
    "Bunk[1,5,3]": 1080,
    "Cunk[3,4,4,3]": 1081,
    "Gunk[5,2,3,11]": 1082,
    "Gunk[4,2,4,3]": 1083,
    "Funk[3,4,4,3,3]": 1084,
    "Dunk[4,3,11]": 1085,
    "G#unk[2,3,2,3,11]": 1086,
    "C#unk[6,3]": 1087,
    "Aunk[4,3,3,7,3]": 1088,
    "G#unk[4,3,3,5,3]": 1089,
    "D#aug7": 1090,
    "Dunk[3,3,4,3]": 1091,
    "Funk[5,2,14]": 1092,
    "Dunk[4,4,9]": 1093,
    "Gunk[4,2,5,2,4,4]": 1094,
    "Gunk[2,4]": 1095,
    "Dunk[3,3,5]": 1096,
    "Gunk[3,3,3,8]": 1097,
    "Dunk[5,2,4,9]": 1098,
    "Dunk[3,4,3,11]": 1099,
    "Gunk[7,3,4,3]": 1100,
    "Funk[2,5,4,7]": 1101,
    "Bunk[4,3,4,3,3,4]": 1102,
    "G#unk[4,3,3,4,4]": 1103,
    "C#unk[4,3,3,11]": 1104,
    "F#unk[3,7]": 1105,
    "Gunk[5,2,14]": 1106,
    "C#unk[2,3,5]": 1107,
    "Gunk[4,3,3,4,7]": 1108,
    "Bunk[4,3,3,8]": 1109,
    "A#unk[4,3,3,3,4,4]": 1110,
    "Eunk[3,4,11]": 1111,
    "Gunk[1,4,2,3]": 1112,
    "Cunk[4,3,8,3]": 1113,
    "Funk[4,2,4,3]": 1114,
    "D#unk[2,4,4]": 1115,
    "Dunk[4,3,3,4,6]": 1116,
    "Cunk[4,3,7,4]": 1117,
    "Dunk[3,4,7,3]": 1118,
    "Eunk[4,2]": 1119,
    "Cunk[3,4,3,8]": 1120,
    "Cunk[2,3,2,4,10]": 1121,
    "Aunk[2,3,2,3,11]": 1122,
    "Dunk[4,3,3,8]": 1123,
    "F#unk[4,3,4,3,3,3]": 1124,
    "D#unk[4,3,3,3,4,4]": 1125,
    "D#unk[3,3,3,4,3]": 1126,
    "F#unk[2,5,3,8]": 1127,
    "Dunk[4,3,4,6]": 1128,
    "Funk[3,4,7,3]": 1129,
    "G#unk[2,5,4,9]": 1130,
    "Eunk[3,7,7]": 1131,
    "Eunk[7,3,7,4]": 1132,
    "A#unk[6]": 1133,
    "Eunk[2,6,3]": 1134,
    "G#unk[4,4,2,3]": 1135,
    "G#unk[4,3,6]": 1136,
    "F#unk[3,3,4,10]": 1137,
    "Aunk[4,4,2,3]": 1138,
    "Bunk[3,4,3,10]": 1139,
    "Cunk[4,3,7,4,3]": 1140,
    "A#unk[4,3,4,4,3]": 1141,
    "Bunk[5,2,3,4,7]": 1142,
    "Cunk[4,3,3,4,4]": 1143,
    "Aunk[4,3,3,8]": 1144,
    "G#unk[4,3,3,3,4]": 1145,
    "C#unk[4,2]": 1146,
    "Bunk[2,5,3,4,3]": 1147,
    "G#unk[3,3,4,4]": 1148,
    "F#unk[2,3,2,3]": 1149,
    "G#unk[3,6]": 1150,
    "A#unk[3,6]": 1151,
    "C#unk[4,3,3,7]": 1152,
    "Funk[4,3,3,7]": 1153,
    "C#unk[6,4,10]": 1154,
    "Eunk[4,3,7,3,4]": 1155,
    "Bunk[3,3,4,10]": 1156,
    "Cunk[4,3,3,8,3]": 1157,
    "C#unk[4,3,11]": 1158,
    "F#unk[5,2,3,4,7]": 1159,
    "Bunk[3,3,3,11]": 1160,
    "F#unk[5,2,7]": 1161,
    "C#unk[3,4,7,3]": 1162,
    "Dunk[6,4,3]": 1163,
    "D#unk[2,5,14]": 1164,
    "A#unk[1,4,2]": 1165,
    "Gunk[2,3,2,3,10]": 1166,
    "C#unk[4,2,5]": 1167,
    "Eunk[3,7,4]": 1168,
    "Cunk[2,3,2,14]": 1169,
    "Cunk[4,17]": 1170,
    "F#unk[4,6,11]": 1171,
    "Funk[7,3,4]": 1172,
    "Cunk[2]": 1173,
    "G#unk[3,5]": 1174,
    "Aunk[7,4]": 1175,
    "C#unk[3,5,2,7]": 1176,
    "Bunk[4,3,3,4,7]": 1177,
    "Funk[6]": 1178,
    "Dunk[4,3,13]": 1179,
    "A#unk[3]": 1180,
    "Cunk[4,2,5,10]": 1181,
    "Aunk[6,4,3]": 1182,
    "G#unk[7,4,3]": 1183,
    "Aunk[4,7,10]": 1184,
    "Cunk[5,3]": 1185,
    "D#unk[3,4,3,3]": 1186,
    "Dunk[3,4,11]": 1187,
    "Eunk[5,2,3,3]": 1188,
    "Eunk[5]": 1189,
    "Aunk[3,3,7,7]": 1190,
    "F#unk[4,2,8,7]": 1191,
    "Funk[11,3,3]": 1192,
    "A#unk[2,5,14]": 1193,
    "Bunk[3,3,4,3,4,3]": 1194,
    "D#unk[3,4,3,3,4,3]": 1195,
    "Dunk[3,7,4,3]": 1196
  },
  "idx2chord": {
    "0": "<PAD>",
    "1": "<UNK>",
    "2": "G",
    "3": "C",
    "4": "D",
    "5": "F",
    "6": "A",
    "7": "E",
    "8": "A#",
    "9": "D#",
    "10": "Am",
    "11": "G#",
    "12": "B",
    "13": "Em",
    "14": "C#",
    "15": "Dm",
    "16": "F#",
    "17": "Cm",
    "18": "Bm",
    "19": "Gm",
    "20": "F#m",
    "21": "Fm",
    "22": "C#m",
    "23": "D#m",
    "24": "G#m",
    "25": "A#m",
    "26": "Am7",
    "27": "Em7",
    "28": "Dm7",
    "29": "Gm7",
    "30": "Bm7",
    "31": "Cm7",
    "32": "F#m7",
    "33": "Fm7",
    "34": "G7",
    "35": "C#m7",
    "36": "Fmaj7",
    "37": "D7",
    "38": "Cmaj7",
    "39": "C7",
    "40": "A7",
    "41": "A#m7",
    "42": "D#m7",
    "43": "G#maj7",
    "44": "Dmaj7",
    "45": "G#m7",
    "46": "Gmaj7",
    "47": "E7",
    "48": "B7",
    "49": "F7",
    "50": "A#7",
    "51": "D#maj7",
    "52": "A#maj7",
    "53": "Amaj7",
    "54": "G#7",
    "55": "Bmaj7",
    "56": "F#maj7",
    "57": "C#maj7",
    "58": "Emaj7",
    "59": "D#7",
    "60": "C#7",
    "61": "F#7",
    "62": "Cunk[4,3,7]",
    "63": "Gsus4",
    "64": "Dsus4",
    "65": "Asus4",
    "66": "Funk[4,3,7]",
    "67": "Dunk[4,3,7]",
    "68": "Bdim",
    "69": "C#dim",
    "70": "Ddim",
    "71": "Aunk[4,3,7]",
    "72": "F#dim",
    "73": "Csus4",
    "74": "Edim",
    "75": "Gunk[4,3,7]",
    "76": "Fsus4",
    "77": "Esus4",
    "78": "C#sus4",
    "79": "G#dim",
    "80": "G#unk[4,3,7]",
    "81": "D#dim",
    "82": "D#unk[4,3,7]",
    "83": "Bunk[4,3,7]",
    "84": "A#sus4",
    "85": "Bsus4",
    "86": "A#unk[4,3,7]",
    "87": "G#sus4",
    "88": "C#unk[4,3,7]",
    "89": "Gdim",
    "90": "Asus2",
    "91": "Cdim",
    "92": "Dm7b5",
    "93": "Em7b5",
    "94": "Adim",
    "95": "Esus2",
    "96": "Bm7b5",
    "97": "A#dim",
    "98": "D#sus4",
    "99": "F#m7b5",
    "100": "Fdim",
    "101": "Csus2",
    "102": "Eunk[4,3,7]",
    "103": "Dsus2",
    "104": "Am7b5",
    "105": "Bsus2",
    "106": "Gsus2",
    "107": "Fsus2",
    "108": "F#sus4",
    "109": "Gunk[5,2,3]",
    "110": "F#unk[4,3,7]",
    "111": "D#sus2",
    "112": "A#sus2",
    "113": "C#sus2",
    "114": "C#m7b5",
    "115": "D#m7b5",
    "116": "Aunk[3,4,7]",
    "117": "Dunk[5,2,3]",
    "118": "Cunk[5,2,3]",
    "119": "Aunk[5,2,3]",
    "120": "Cmaj9",
    "121": "Eunk[3,4,3,4]",
    "122": "Gunk[3,4,7]",
    "123": "Dunk[2,5,3]",
    "124": "Fm7b5",
    "125": "D#unk[5,2,3]",
    "126": "Gm7b5",
    "127": "A#unk[5,2,3]",
    "128": "Bunk[5,2,3]",
    "129": "Gunk[4,3,3,4,3]",
    "130": "Funk[3,4,3,4]",
    "131": "Eunk[5,2,3]",
    "132": "Cm7b5",
    "133": "G#m7b5",
    "134": "D#unk[3,4,3,4]",
    "135": "Aunk[3,4,3,4]",
    "136": "Gunk[3,4,3,4]",
    "137": "Cunk[4,3,3,4,3]",
    "138": "D#maj9",
    "139": "G#sus2",
    "140": "G#unk[5,2,3]",
    "141": "F#unk[3,4,7]",
    "142": "A#m7b5",
    "143": "F#sus2",
    "144": "Eunk[2,5,3]",
    "145": "Fmaj9",
    "146": "Aunk[4,3,3,4,3]",
    "147": "Dunk[3,4,7]",
    "148": "A#unk[3,4,7]",
    "149": "Gunk[7]",
    "150": "Cunk[2,5,3]",
    "151": "Dunk[4,3,3,4,3]",
    "152": "Cunk[3,4,3,4]",
    "153": "Dunk[3,4,3,4,3]",
    "154": "Funk[2,5,4]",
    "155": "F#unk[5,2,3]",
    "156": "Dunk[3,4,3,4]",
    "157": "Eunk[4,3,3,4,3]",
    "158": "Gmaj9",
    "159": "Funk[3,4,7]",
    "160": "F#unk[3,4,3,4]",
    "161": "Cunk[3,4,7]",
    "162": "Dmaj9",
    "163": "F#unk[3,4,3,4,3]",
    "164": "Funk[5,2,3]",
    "165": "F#dim7",
    "166": "Cunk[3,4,3,4,3]",
    "167": "Emaj9",
    "168": "C#unk[5,2,3]",
    "169": "Aunk[3,4,3,4,3]",
    "170": "D#unk[2,5,3]",
    "171": "C#maj9",
    "172": "G#unk[3,4,3,4]",
    "173": "Bunk[3,4,3,4,3]",
    "174": "D#unk[3,4,7]",
    "175": "Eunk[3,4,3,4,3]",
    "176": "Cunk[7]",
    "177": "Cunk[2,5,4]",
    "178": "Dunk[2,5,4]",
    "179": "A#unk[4,3,3,4,3]",
    "180": "Aunk[2,5,3]",
    "181": "D#unk[2,5,4]",
    "182": "C9",
    "183": "A#unk[3,4,3,4]",
    "184": "Amaj9",
    "185": "C#dim7",
    "186": "Funk[3,4,3,4,3]",
    "187": "Bunk[4,3,3,4,3]",
    "188": "Bdim7",
    "189": "C#unk[3,4,3,4]",
    "190": "D9",
    "191": "A#unk[2,5,3]",
    "192": "Bunk[3,4,7]",
    "193": "C#unk[2,5,3]",
    "194": "Gunk[2,5,3]",
    "195": "A#maj9",
    "196": "D#unk[4,3,3,4,3]",
    "197": "Cunk[6,1]",
    "198": "F#maj9",
    "199": "G#dim7",
    "200": "G#unk[2,5,3]",
    "201": "C#unk[4,3,3,4,3]",
    "202": "G#maj9",
    "203": "Funk[4,3,3,4,3]",
    "204": "D#dim7",
    "205": "Funk[2,5,3]",
    "206": "Bunk[2,5,3]",
    "207": "Eunk[3,4,7]",
    "208": "Dunk[2,3,2]",
    "209": "Gunk[2,5,4]",
    "210": "Edim7",
    "211": "C#unk[3,4,3,4,3]",
    "212": "F9",
    "213": "Cunk[empty]",
    "214": "G#unk[3,4,7]",
    "215": "Bunk[3,4,3,4]",
    "216": "C#unk[3,4,7]",
    "217": "Gunk[2,3,2]",
    "218": "Adim7",
    "219": "Cunk[2,3,2]",
    "220": "A#unk[2,5,4]",
    "221": "Gunk[3,4,3,4,3]",
    "222": "D#unk[3,4,3,4,3]",
    "223": "G#unk[4,3,3,4,3]",
    "224": "A#unk[3,4,3,4,3]",
    "225": "A#dim7",
    "226": "Caug",
    "227": "D#9",
    "228": "G9",
    "229": "Aunk[2,5,4]",
    "230": "Fdim7",
    "231": "Bmaj9",
    "232": "Eunk[7]",
    "233": "Aunk[2,3,2]",
    "234": "Eunk[2,3,2]",
    "235": "Eunk[2,5,4]",
    "236": "Funk[6,1]",
    "237": "Gdim7",
    "238": "A9",
    "239": "F#unk[2,5,4]",
    "240": "Ddim7",
    "241": "C#unk[2,3,2]",
    "242": "Funk[2,3,2]",
    "243": "F#unk[2,5,3]",
    "244": "G#unk[2,5,4]",
    "245": "A#unk[2,3,2]",
    "246": "Bunk[2,5,4]",
    "247": "Aunk[7]",
    "248": "Cdim7",
    "249": "E9",
    "250": "A#9",
    "251": "C#unk[2,5,4]",
    "252": "B9",
    "253": "Gaug",
    "254": "Funk[empty]",
    "255": "Dunk[4,3,3,3]",
    "256": "Bunk[empty]",
    "257": "A#unk[3,4,3,7]",
    "258": "Faug",
    "259": "Daug",
    "260": "Eunk[4,3,3,3]",
    "261": "Eunk[3,4,3,7]",
    "262": "Funk[7]",
    "263": "Bunk[2,3,2]",
    "264": "F#unk[4,3,3,4,3]",
    "265": "Dunk[7]",
    "266": "F#aug",
    "267": "A#unk[empty]",
    "268": "Bunk[3,4,3,7]",
    "269": "D#aug",
    "270": "Gunk[4,3,14]",
    "271": "F#unk[2,3,2]",
    "272": "A#unk[3,3,4,3,4]",
    "273": "Aunk[4,3,10]",
    "274": "D#unk[2,3,2]",
    "275": "Eunk[4,3,14]",
    "276": "Gunk[3,4,3,7]",
    "277": "Aunk[4,3,3,3]",
    "278": "AmMaj7",
    "279": "Eaug",
    "280": "A#unk[4,3,3,4,3,4]",
    "281": "G#unk[3,4,3,4,3]",
    "282": "Dunk[empty]",
    "283": "Gunk[5]",
    "284": "D#unk[3,4,6]",
    "285": "Aunk[3,4,3,7]",
    "286": "DmMaj7",
    "287": "Bunk[7]",
    "288": "F#unk[3,4,3,7]",
    "289": "C#9",
    "290": "Cunk[5]",
    "291": "G#unk[empty]",
    "292": "Aunk[4,3,3,4,3,4]",
    "293": "Eunk[4,3,3,5]",
    "294": "G#aug",
    "295": "Bunk[4,3,3,3]",
    "296": "Gunk[6,1]",
    "297": "Baug",
    "298": "Gunk[4,3,3,4,3,4]",
    "299": "Aaug",
    "300": "D#unk[4,6]",
    "301": "Cunk[4,3,4,3,3]",
    "302": "C#unk[4,3,4,3,4]",
    "303": "Cunk[4,3,3,3]",
    "304": "A#unk[7]",
    "305": "Cunk[4,3,10]",
    "306": "C#aug",
    "307": "G#unk[3,4,3,7]",
    "308": "G#unk[2,3,2]",
    "309": "Eunk[3,3,7]",
    "310": "Gunk[3,3,4,3,4]",
    "311": "C#unk[3,4,3,7]",
    "312": "D#unk[7]",
    "313": "Dunk[4,3,14]",
    "314": "Faug7",
    "315": "Bunk[4,3,3,5]",
    "316": "Dunk[4,3,7,7]",
    "317": "Dunk[4,2,4]",
    "318": "Eunk[4,3,4,4,3,3]",
    "319": "F#unk[3,3,4,3,4]",
    "320": "Funk[4,3,14]",
    "321": "Cunk[2,3,2,3]",
    "322": "F#unk[3,4,10]",
    "323": "Bunk[1,5,4]",
    "324": "Funk[3,4,3,7]",
    "325": "Gunk[4,3,3,3]",
    "326": "Cunk[6,2]",
    "327": "A#unk[6,1]",
    "328": "Bunk[6,1]",
    "329": "Aunk[4,3,14]",
    "330": "C#unk[4,3,10]",
    "331": "Eunk[3,4,10]",
    "332": "Eunk[4,3,10]",
    "333": "C#unk[6,1]",
    "334": "Eunk[1,6,3]",
    "335": "D#unk[6,1]",
    "336": "D#unk[3,3,4,3,4]",
    "337": "G#9",
    "338": "Gunk[4,3,7,7]",
    "339": "Cunk[4,3,7,7]",
    "340": "Bunk[4,3,3,10]",
    "341": "Cunk[4,3,14]",
    "342": "Dunk[4,3,10]",
    "343": "Gunk[3]",
    "344": "Gunk[empty]",
    "345": "Funk[1,5,4]",
    "346": "Aunk[4,3,3,10]",
    "347": "Funk[4,6]",
    "348": "D#unk[4,3,10]",
    "349": "Funk[4,4,3]",
    "350": "Gunk[2,5,14]",
    "351": "F#9",
    "352": "A#unk[4,3,14]",
    "353": "A#aug",
    "354": "Bunk[4,3,3,4,3,4]",
    "355": "Cunk[3,4,3,7]",
    "356": "Aunk[empty]",
    "357": "G#unk[7]",
    "358": "C#unk[empty]",
    "359": "CmMaj7",
    "360": "Aunk[3,4,10]",
    "361": "D#unk[5,2,4]",
    "362": "Eunk[6,1]",
    "363": "Dunk[5,2,4]",
    "364": "FmMaj7",
    "365": "Gunk[3,4,10]",
    "366": "BmMaj7",
    "367": "Gunk[1,6,3]",
    "368": "Aunk[6,1]",
    "369": "Dunk[3,4,3,3,4]",
    "370": "F#unk[4,3,3,3]",
    "371": "Aunk[4,2,4]",
    "372": "Cunk[5,2,3,4]",
    "373": "Dunk[4,3,3,5]",
    "374": "D#unk[empty]",
    "375": "Cunk[4,4,3]",
    "376": "Cunk[4,3,4,4,3]",
    "377": "Bunk[5,2,3,4]",
    "378": "C#unk[4,17]",
    "379": "Eunk[3]",
    "380": "A#unk[4,4,3]",
    "381": "F#unk[7]",
    "382": "Gunk[4,4,3]",
    "383": "Bunk[3,4,10]",
    "384": "Bunk[4,3,10]",
    "385": "Gunk[3,4,3,3,4]",
    "386": "Gunk[4,3,3,10]",
    "387": "Dunk[2,4,1]",
    "388": "Eunk[3,3,4,3,4]",
    "389": "G#unk[4,3,4,3,4]",
    "390": "Bunk[3,3,4,3,4]",
    "391": "Aunk[3,3,4,3]",
    "392": "Gaug7",
    "393": "D#mMaj7",
    "394": "F#unk[empty]",
    "395": "C#unk[4,3,3,3]",
    "396": "Aunk[2,4,1]",
    "397": "Dunk[6,1]",
    "398": "F#unk[5,1]",
    "399": "Funk[4,3,4,10]",
    "400": "F#unk[4,3,3,4,3,4]",
    "401": "D#unk[4,3,3,3]",
    "402": "G#unk[4,3,14]",
    "403": "Gunk[3,4,14]",
    "404": "GmMaj7",
    "405": "D#unk[3,4,3,7]",
    "406": "F#unk[4,17]",
    "407": "F#unk[3,4,6]",
    "408": "C#unk[3,4,3,3,4]",
    "409": "Aunk[3,4,3,3]",
    "410": "Baug7",
    "411": "Funk[4,3,3,11]",
    "412": "Cunk[4,3,6]",
    "413": "Aunk[3]",
    "414": "Dunk[3]",
    "415": "Aunk[4,3,7,7]",
    "416": "C#unk[3,4,10]",
    "417": "Gunk[4,3,10]",
    "418": "F#unk[4,3,10]",
    "419": "D#unk[4,4,3]",
    "420": "Funk[4,3,4,7]",
    "421": "F#aug7",
    "422": "Dunk[3,4,3,7]",
    "423": "Cunk[4,3,11]",
    "424": "Aunk[4,3,3,11]",
    "425": "Gunk[4,3,4,10]",
    "426": "Bunk[7,7]",
    "427": "Funk[4,3,3,8]",
    "428": "Eunk[5,2,3,4]",
    "429": "Gunk[5,2,4]",
    "430": "Dunk[1,6,3]",
    "431": "Funk[4,3,3,3]",
    "432": "Funk[4]",
    "433": "Cunk[2,3,2,4]",
    "434": "G#unk[4,3,3,3]",
    "435": "Funk[4,3,10]",
    "436": "Dunk[3,4,10]",
    "437": "C#unk[7]",
    "438": "Cunk[7,4]",
    "439": "A#unk[4,3,3,10]",
    "440": "G#unk[4,3,4,3,4,3]",
    "441": "G#unk[6]",
    "442": "Cunk[7,7]",
    "443": "G#unk[6,1]",
    "444": "Gunk[4,3,4,3,4]",
    "445": "Cunk[2,4,1]",
    "446": "Aaug7",
    "447": "Bunk[4,3,14]",
    "448": "Eunk[empty]",
    "449": "Gunk[2,3,2,3]",
    "450": "Dunk[4,2]",
    "451": "Bunk[7,3]",
    "452": "G#unk[3,4,14]",
    "453": "Eunk[4,3,3,10]",
    "454": "A#unk[3,4,10]",
    "455": "G#mMaj7",
    "456": "F#unk[4,3,3,3,7]",
    "457": "F#unk[3,4,3,10]",
    "458": "Cunk[4,3,3,10]",
    "459": "Bunk[4,3,4,7]",
    "460": "Bunk[3,3,5]",
    "461": "Aunk[7,7]",
    "462": "Aunk[5,2,4]",
    "463": "Gunk[3,4,6]",
    "464": "Dunk[1,5,4]",
    "465": "Dunk[3,3,7]",
    "466": "Eunk[3,4,3,3]",
    "467": "Bunk[3,4,3,3,4]",
    "468": "Dunk[3,3,4,3,4]",
    "469": "G#unk[1,5,4]",
    "470": "Gunk[4,3,4,3,3]",
    "471": "A#mMaj7",
    "472": "Eunk[3,4,14]",
    "473": "C#mMaj7",
    "474": "D#unk[3,4,14]",
    "475": "A#unk[4,3,11]",
    "476": "Bunk[4,3,11]",
    "477": "G#unk[10]",
    "478": "D#unk[4,3,7,7]",
    "479": "F#unk[4,3,3,5]",
    "480": "A#unk[4,3,7,7]",
    "481": "G#unk[4,3,3,4,3,4]",
    "482": "Dunk[4,3,4,3,3,3]",
    "483": "A#unk[4,3,4,10]",
    "484": "D#unk[4,3,3,11]",
    "485": "Aunk[2,3,2,4]",
    "486": "Funk[6,1,4]",
    "487": "F#unk[2,4,1]",
    "488": "Funk[4,3,4,3,4]",
    "489": "G#unk[3,4,3,3,4]",
    "490": "D#unk[4,3,4,3,4]",
    "491": "A#unk[4,3,4,3,4]",
    "492": "Dunk[4,3,4,3,3]",
    "493": "Bunk[3,4,3,3]",
    "494": "Gunk[1,5,4]",
    "495": "F#mMaj7",
    "496": "Funk[4,3,3,5]",
    "497": "Aunk[4,3,3,5]",
    "498": "G#unk[4,2,4]",
    "499": "Caug7",
    "500": "A#unk[4]",
    "501": "Gunk[4,3,3,3,4,4]",
    "502": "F#unk[4,3,3,10]",
    "503": "Cunk[4,3,3,5]",
    "504": "D#unk[4,3,11]",
    "505": "G#unk[4,3,7,7]",
    "506": "Eunk[4,3,8,6]",
    "507": "Aunk[4,3,11]",
    "508": "A#unk[4,3,3,11]",
    "509": "Gunk[4,7]",
    "510": "D#unk[6,1,4]",
    "511": "Funk[2,4,1]",
    "512": "Aunk[5,1,4]",
    "513": "G#unk[6,1,4]",
    "514": "Funk[3,4,6]",
    "515": "Cunk[1,6,3]",
    "516": "D#unk[3,3,7]",
    "517": "Eunk[5,2,4]",
    "518": "C#unk[5,1]",
    "519": "F#unk[6,1]",
    "520": "A#unk[1,5]",
    "521": "A#unk[2,4,1]",
    "522": "Cunk[6,1,4]",
    "523": "D#unk[5,1,4]",
    "524": "F#unk[5,2,4]",
    "525": "Eunk[3,4,3,3,4]",
    "526": "A#aug7",
    "527": "Daug7",
    "528": "C#unk[4,3,3,4,4]",
    "529": "Gunk[4]",
    "530": "Bunk[3]",
    "531": "D#unk[4,3,14]",
    "532": "G#unk[2,3,2,3]",
    "533": "Aunk[2,3,2,3]",
    "534": "Eunk[7,3]",
    "535": "F#unk[11]",
    "536": "Aunk[3,4,3,7,3]",
    "537": "Eunk[4,3,3,5,5]",
    "538": "C#unk[3,7]",
    "539": "Gunk[4,3,3,7]",
    "540": "Aunk[4,3,3,3,7]",
    "541": "A#unk[2,3,2,3,11]",
    "542": "A#unk[4,3,3,3,7]",
    "543": "Aunk[4,3,3,4,7]",
    "544": "Dunk[7,3]",
    "545": "Funk[4,3,11]",
    "546": "Funk[5,2,7]",
    "547": "Gunk[3,3,5]",
    "548": "Eunk[7,7]",
    "549": "Dunk[4,3,11,3]",
    "550": "Funk[5,1,4]",
    "551": "Eunk[5,1]",
    "552": "Bunk[2,4,1]",
    "553": "Funk[4,3,4,3,3]",
    "554": "Aunk[1,5,4]",
    "555": "C#unk[1,6]",
    "556": "Eaug7",
    "557": "Dunk[5,2,3,4]",
    "558": "G#unk[4,3,3,11]",
    "559": "Aunk[3,4,14]",
    "560": "C#unk[4,4,3]",
    "561": "Dunk[4,3,3,10]",
    "562": "D#unk[3,4,10]",
    "563": "Eunk[3,4,3,7,3]",
    "564": "Cunk[4]",
    "565": "A#unk[4,3,3,3]",
    "566": "Cunk[3,4,14]",
    "567": "Aunk[4,2]",
    "568": "Dunk[7,4]",
    "569": "Dunk[3,4,3,4,3,4]",
    "570": "A#unk[4,3,4,7]",
    "571": "Dunk[4,3,3,7]",
    "572": "G#unk[7,4,4,3]",
    "573": "Bunk[4,3,3,11]",
    "574": "Gunk[4,2,4]",
    "575": "Aunk[4,3,3,7]",
    "576": "C#unk[4,3,3,10]",
    "577": "Aunk[4,3,3,5,5]",
    "578": "Dunk[3,7]",
    "579": "A#unk[2,3,5]",
    "580": "Funk[4,3,3,4,3,4]",
    "581": "Cunk[4,3,4,3,7]",
    "582": "Bunk[4,3,4,10]",
    "583": "Bunk[3,4,3,4,4,3]",
    "584": "D#unk[7,3,4]",
    "585": "Eunk[4,6,4]",
    "586": "D#unk[5,2,3,4]",
    "587": "Eunk[3,5]",
    "588": "Bunk[5,1,4]",
    "589": "Gunk[6,1,4]",
    "590": "A#unk[5,2,4]",
    "591": "Eunk[6,1,4]",
    "592": "Gunk[2,4,1]",
    "593": "Eunk[4,3,4,3,3]",
    "594": "Aunk[3,4,3,3,4]",
    "595": "Eunk[3,4,6]",
    "596": "A#unk[3,4,3,3]",
    "597": "Aunk[3,3,4,3,4]",
    "598": "G#unk[5,2,4]",
    "599": "Funk[3,3,4,3,4]",
    "600": "C#unk[4,3,14]",
    "601": "Aunk[3,3,4,10]",
    "602": "Aunk[4,3,4,10]",
    "603": "Aunk[5,2,3,4,7]",
    "604": "A#unk[4,3,3,5]",
    "605": "Bunk[3,7]",
    "606": "EmMaj7",
    "607": "Dunk[2,3,2,3]",
    "608": "Funk[4,3,4,3,4,3]",
    "609": "D#unk[7,3]",
    "610": "Dunk[4]",
    "611": "Funk[11]",
    "612": "Funk[3,4,3,7,3]",
    "613": "G#unk[4,4,3]",
    "614": "C#unk[4,3,3,4,3,4]",
    "615": "F#unk[3,4,14]",
    "616": "A#unk[4,7]",
    "617": "Aunk[5,2,3,11]",
    "618": "G#unk[3,7]",
    "619": "Gunk[4,2]",
    "620": "Dunk[4,3,3,4,3,4]",
    "621": "Aunk[3,3,4,7,3]",
    "622": "Gunk[4,3,10,4]",
    "623": "Eunk[2,3,2,4]",
    "624": "A#unk[2,3,2,3]",
    "625": "Cunk[4,3,3,11]",
    "626": "D#unk[4,3,4,3,7]",
    "627": "C#unk[2,4,1]",
    "628": "Cunk[3,3,7]",
    "629": "Eunk[5,1,4]",
    "630": "Bunk[1,6,3]",
    "631": "Eunk[1,6]",
    "632": "Funk[1,6,3]",
    "633": "Dunk[4,3,4,3,4]",
    "634": "Cunk[1,5,4]",
    "635": "Funk[3,4,3,3,4]",
    "636": "F#unk[4,4,3]",
    "637": "Eunk[1,5,4]",
    "638": "Cunk[4,3,4,7]",
    "639": "Bunk[4,4,2,5]",
    "640": "Eunk[4,4,2,5]",
    "641": "Aunk[3,7]",
    "642": "Dunk[5,5]",
    "643": "Bunk[4,3,3,5,5]",
    "644": "Bunk[4,4,3]",
    "645": "Aunk[3,5,2]",
    "646": "G#unk[5,2,3,11]",
    "647": "Cunk[4,2,5]",
    "648": "D#unk[3,4,13]",
    "649": "Gunk[4,3,6]",
    "650": "Cunk[3,4,7,3]",
    "651": "Eunk[7,3,4]",
    "652": "Eunk[4,3,7,7]",
    "653": "G#unk[8]",
    "654": "A#unk[4,3,10]",
    "655": "G#unk[4,3,11]",
    "656": "Aunk[5]",
    "657": "Eunk[3,3,11,4]",
    "658": "Bunk[3,4,3,4,3,3]",
    "659": "G#unk[4,3,3,10]",
    "660": "Bunk[4,3,3,3,7]",
    "661": "Eunk[4,4,3]",
    "662": "Funk[4,3,7,7]",
    "663": "G#unk[4,3,8]",
    "664": "G#unk[4,3,4,7]",
    "665": "Aunk[4,3,7,3]",
    "666": "Gunk[7,3]",
    "667": "Gunk[3,4,3,10]",
    "668": "A#unk[3,4,14]",
    "669": "Eunk[4,3,3,11]",
    "670": "Dunk[4,3,3,3,7]",
    "671": "G#unk[4,3,4,3,3,3]",
    "672": "Cunk[3,4,3,10]",
    "673": "Funk[4,3,3,10]",
    "674": "C#unk[4,3,3,5]",
    "675": "Eunk[6,1,3]",
    "676": "A#unk[1,3,2]",
    "677": "Dunk[2,3,2,4]",
    "678": "C#unk[4,3,3,4,7]",
    "679": "Gunk[4,3,3,11]",
    "680": "Eunk[4,3,3,7]",
    "681": "Gunk[7,7]",
    "682": "F#unk[7,3,4]",
    "683": "Aunk[2,5,4,8]",
    "684": "Aunk[4,3,4,3,5,2]",
    "685": "Aunk[3,5,3]",
    "686": "F#unk[3,3,7]",
    "687": "Cunk[5,2,4]",
    "688": "Bunk[5,1]",
    "689": "Aunk[3,3,7]",
    "690": "C#unk[3,3,7]",
    "691": "F#unk[1,6,3]",
    "692": "Gunk[3,3,7]",
    "693": "Aunk[6,1,4]",
    "694": "Bunk[5,2,4]",
    "695": "Aunk[4,3,4,3,3]",
    "696": "Aunk[3,4,6]",
    "697": "Funk[3,4,3,3]",
    "698": "Bunk[1,6]",
    "699": "D#unk[3,4,3,10]",
    "700": "D#unk[1,5,4]",
    "701": "C#unk[6,4]",
    "702": "Cunk[4,3,4,10]",
    "703": "F#unk[4,3,3,11]",
    "704": "C#unk[3,4,14]",
    "705": "Eunk[3,4,13]",
    "706": "D#unk[4,2,4]",
    "707": "Gunk[2,3,2,3,11]",
    "708": "C#unk[4,3,3,3,4,4]",
    "709": "Aunk[4,4,3]",
    "710": "G#unk[4,3,3,5]",
    "711": "Bunk[4,2,4]",
    "712": "Cunk[3,4,10]",
    "713": "D#unk[4,3,3,4,3,4]",
    "714": "Bunk[5,5]",
    "715": "D#unk[7,4]",
    "716": "Dunk[4,7,3]",
    "717": "Cunk[4,3,4,3,3,4]",
    "718": "Dunk[3,4,3,3]",
    "719": "F#unk[4,2]",
    "720": "F#unk[4,3,4,7]",
    "721": "Bunk[4,3,3,7]",
    "722": "C#unk[4,3,3,3,7]",
    "723": "Cunk[4,3,3,4,3,4]",
    "724": "G#unk[4,3,4,10]",
    "725": "G#aug7",
    "726": "Aunk[3,3,11,4]",
    "727": "Eunk[3,4,3,4,3,3]",
    "728": "Eunk[3,7]",
    "729": "Cunk[4,3,3,5,5]",
    "730": "C#unk[4,3,3,8]",
    "731": "F#unk[4,2,4]",
    "732": "Gunk[4,3,4,3,3,3]",
    "733": "Eunk[4,6]",
    "734": "Cunk[4,3,3,7]",
    "735": "Funk[3,4,7,4]",
    "736": "Eunk[4,3,4,7]",
    "737": "Gunk[1,6]",
    "738": "G#unk[4,3,8,3]",
    "739": "C#unk[2,3,2,3]",
    "740": "Eunk[4,3,4,10]",
    "741": "Bunk[1,4,2,3]",
    "742": "Eunk[4,3,3,4,3,4]",
    "743": "Cunk[4,3,7,3]",
    "744": "G#unk[4,3,3,8]",
    "745": "Gunk[4,3,4,3,4,3]",
    "746": "F#unk[2,3,2,4]",
    "747": "D#unk[4,3,3,10]",
    "748": "Funk[5,2,3,4]",
    "749": "Dunk[3,4,14]",
    "750": "C#unk[1,4,1,4,11]",
    "751": "Dunk[3,4,7,7]",
    "752": "Funk[4,4,2,3]",
    "753": "G#unk[5,2,3,4]",
    "754": "C#unk[3,5,2]",
    "755": "F#unk[5,2,3,4]",
    "756": "Eunk[10,3,4]",
    "757": "A#unk[3,4,6]",
    "758": "Cunk[3,4,6]",
    "759": "Funk[3,3,7]",
    "760": "C#unk[1,6,3]",
    "761": "G#unk[2,4,1]",
    "762": "Aunk[4,3,4,3,4]",
    "763": "Dunk[5,1,4]",
    "764": "D#unk[3,4,3,3,4]",
    "765": "Cunk[4,3,4,3,4]",
    "766": "F#unk[3,4,3,3]",
    "767": "D#unk[4,3,4,3,3]",
    "768": "Eunk[3,3,4,3]",
    "769": "F#unk[1,5,3]",
    "770": "G#unk[1,6,3]",
    "771": "G#unk[4,6]",
    "772": "Eunk[4,3,3,4,4]",
    "773": "A#unk[4,3,3,4,4]",
    "774": "C#unk[4,2,4,4]",
    "775": "F#unk[5,1,4]",
    "776": "Bunk[3,4,14]",
    "777": "F#unk[1,5,4]",
    "778": "Cunk[4,6]",
    "779": "Funk[2,3,2,3]",
    "780": "Aunk[4,6]",
    "781": "Funk[7,3]",
    "782": "Eunk[3,4,3,7,4]",
    "783": "D#unk[4,3,3,5]",
    "784": "Dunk[3,3,3,11]",
    "785": "G#unk[4,3,10]",
    "786": "C#aug7",
    "787": "A#unk[4,3,3,8]",
    "788": "Cunk[3,7]",
    "789": "Eunk[4]",
    "790": "D#unk[4,3,4,7]",
    "791": "Cunk[3,3,4,3,4]",
    "792": "Aunk[4,10]",
    "793": "G#unk[3,4,10]",
    "794": "Cunk[7,14]",
    "795": "Bunk[10,9]",
    "796": "Aunk[14,3]",
    "797": "Cunk[4,3,4,3,3,3]",
    "798": "Gunk[11]",
    "799": "Bunk[3,3,3,4,3]",
    "800": "Cunk[4,2,4]",
    "801": "A#unk[3,3,3,4,3]",
    "802": "A#unk[2,5,10]",
    "803": "C#unk[3,4,3,10]",
    "804": "F#unk[3,2]",
    "805": "Cunk[3,3,3,4,3]",
    "806": "F#unk[3]",
    "807": "Gunk[4,4,2,4]",
    "808": "C#unk[4,3,4,7]",
    "809": "A#unk[7,3,4,4]",
