{
  "chord2idx": {
    "<PAD>": 0,
    "<UNK>": 1,
    "G": 2,
    "C": 3,
    "D": 4,
    "F": 5,
    "A": 6,
    "E": 7,
    "A#": 8,
    "D#": 9,
    "Am": 10,
    "G#": 11,
    "B": 12,
    "Em": 13,
    "C#": 14,
    "Dm": 15,
    "F#": 16,
    "Cm": 17,
    "Bm": 18,
    "Gm": 19,
    "F#m": 20,
    "Fm": 21,
    "C#m": 22,
    "D#m": 23,
    "G#m": 24,
    "A#m": 25,
    "Am7": 26,
    "Em7": 27,
    "Dm7": 28,
    "Gm7": 29,
    "Bm7": 30,
    "Cm7": 31,
    "F#m7": 32,
    "Fm7": 33,
    "C#m7": 34,
    "G7": 35,
    "Fmaj7": 36,
    "D7": 37,
    "Cmaj7": 38,
    "C7": 39,
    "A#m7": 40,
    "A7": 41,
    "D#m7": 42,
    "G#maj7": 43,
    "G#m7": 44,
    "Dmaj7": 45,
    "Gmaj7": 46,
    "E7": 47,
    "F7": 48,
    "B7": 49,
    "A#7": 50,
    "D#maj7": 51,
    "A#maj7": 52,
    "Amaj7": 53,
    "G#7": 54,
    "Bmaj7": 55,
    "F#maj7": 56,
    "C#maj7": 57,
    "Emaj7": 58,
    "D#7": 59,
    "C#7": 60,
    "F#7": 61,
    "Cadd9": 62,
    "Gsus4": 63,
    "Dsus4": 64,
    "Asus4": 65,
    "Dadd9": 66,
    "Fadd9": 67,
    "Bdim": 68,
    "C#dim": 69,
    "Ddim": 70,
    "Aadd9": 71,
    "Edim": 72,
    "F#dim": 73,
    "Gadd9": 74,
    "Csus4": 75,
    "Fsus4": 76,
    "G#dim": 77,
    "Esus4": 78,
    "G#add9": 79,
    "C#sus4": 80,
    "D#dim": 81,
    "D#add9": 82,
    "Badd9": 83,
    "A#sus4": 84,
    "A#add9": 85,
    "Bsus4": 86,
    "Cdim": 87,
    "Gdim": 88,
    "G#sus4": 89,
    "C#add9": 90,
    "Dm7b5": 91,
    "Em7b5": 92,
    "Asus2": 93,
    "Bm7b5": 94,
    "F#m7b5": 95,
    "Adim": 96,
    "Esus2": 97,
    "Fdim": 98,
    "A#dim": 99,
    "D#sus4": 100,
    "Eadd9": 101,
    "Csus2": 102,
    "Am7b5": 103,
    "Dsus2": 104,
    "Bsus2": 105,
    "Gsus2": 106,
    "Fsus2": 107,
    "G7sus4": 108,
    "F#sus4": 109,
    "F#add9": 110,
    "D#m7b5": 111,
    "D#sus2": 112,
    "A#sus2": 113,
    "C#m7b5": 114,
    "C#sus2": 115,
    "D7sus4": 116,
    "C5": 117,
    "A7sus4": 118,
    "Amadd9": 119,
    "Cmaj9": 120,
    "Gm7b5": 121,
    "C7sus4": 122,
    "Em9": 123,
    "Fm7b5": 124,
    "D#7sus4": 125,
    "B7sus4": 126,
    "D9sus2": 127,
    "Gmadd9": 128,
    "E7sus4": 129,
    "A#m7b5": 130,
    "G11": 131,
    "A#7sus4": 132,
    "G#m7b5": 133,
    "Cm7b5": 134,
    "D#maj9": 135,
    "Fm9": 136,
    "G5": 137,
    "C11": 138,
    "D#m9": 139,
    "Am9": 140,
    "Gm9": 141,
    "G#7sus4": 142,
    "G#sus2": 143,
    "Fmaj9": 144,
    "F#madd9": 145,
    "E9sus2": 146,
    "A11": 147,
    "F#sus2": 148,
    "Dmadd9": 149,
    "Gmaj9": 150,
    "D11": 151,
    "A#madd9": 152,
    "C#maj9": 153,
    "C9sus2": 154,
    "Dmaj9": 155,
    "F#7sus4": 156,
    "Cm9": 157,
    "E11": 158,
    "Dm11": 159,
    "Fmaj9sus2": 160,
    "Dm9": 161,
    "F7sus4": 162,
    "Fmadd9": 163,
    "Emaj9": 164,
    "C#7sus4": 165,
    "Cmadd9": 166,
    "F#m9": 167,
    "F#dim7": 168,
    "D#9sus2": 169,
    "F#m11": 170,
    "Cm11": 171,
    "Am11": 172,
    "Bm11": 173,
    "Amaj9": 174,
    "G#m9": 175,
    "Em11": 176,
    "Dmaj9sus2": 177,
    "Cmaj9sus2": 178,
    "G#maj9": 179,
    "D#madd9": 180,
    "A9sus2": 181,
    "Bdim7": 182,
    "A#11": 183,
    "Edim7": 184,
    "D#maj9sus2": 185,
    "C9": 186,
    "A#m9": 187,
    "C#dim7": 188,
    "B11": 189,
    "F5": 190,
    "Fm11": 191,
    "A#maj9": 192,
    "C#m9": 193,
    "A#9sus2": 194,
    "D9": 195,
    "F#maj9": 196,
    "Bmadd9": 197,
    "C#9sus2": 198,
    "G9sus2": 199,
    "D#11": 200,
    "G#dim7": 201,
    "E5": 202,
    "G#9sus2": 203,
    "C#11": 204,
    "F11": 205,
    "D#dim7": 206,
    "F9sus2": 207,
    "B9sus2": 208,
    "Emadd9": 209,
    "Dadd9sus4": 210,
    "Gmaj9sus2": 211,
    "Adim7": 212,
    "C#m11": 213,
    "F9": 214,
    "Cpedal": 215,
    "G#madd9": 216,
    "Gadd9sus4": 217,
    "Bm9": 218,
    "C#madd9": 219,
    "A#maj9sus2": 220,
    "A5": 221,
    "Cadd9sus4": 222,
    "A#dim7": 223,
    "Amaj9sus2": 224,
    "Gm11": 225,
    "D#m11": 226,
    "G#11": 227,
    "Bmaj9": 228,
    "A#m11": 229,
    "Caug": 230,
    "D#9": 231,
    "G9": 232,
    "Aadd9sus4": 233,
    "Gdim7": 234,
    "D5": 235,
    "Fadd9sus4": 236,
    "Ddim7": 237,
    "Fdim7": 238,
    "F#9sus2": 239,
    "Eadd9sus4": 240,
    "B5": 241,
    "Emaj9sus2": 242,
    "E9": 243,
    "D#5": 244,
    "Cdim7": 245,
    "A9": 246,
    "F#maj9sus2": 247,
    "A#add9sus4": 248,
    "C#add9sus4": 249,
    "G#maj9sus2": 250,
    "Bmaj9sus2": 251,
    "A#9": 252,
    "Baug7": 253,
    "Gaug": 254,
    "C#maj9sus2": 255,
    "B9": 256,
    "A13": 257,
    "Faug": 258,
    "Daug": 259,
    "Aaug7": 260,
    "Fpedal": 261,
    "A#5": 262,
    "D7b9": 263,
    "Bpedal": 264,
    "Badd9sus4": 265,
    "E7b9": 266,
    "F#11": 267,
    "A#13": 268,
    "F#aug": 269,
    "A#pedal": 270,
    "C#5": 271,
    "Gaug7": 272,
    "AmMaj7": 273,
    "F#add9sus4": 274,
    "G#5": 275,
    "D#aug": 276,
    "C11sus4": 277,
    "Eaug": 278,
    "Gadd13": 279,
    "Faug7": 280,
    "Aadd11": 281,
    "D#add9sus4": 282,
    "Gadd9sus2": 283,
    "G13": 284,
    "Eadd13": 285,
    "A7b9": 286,
    "Eaug7": 287,
    "F#aug7": 288,
    "E75": 289,
    "Gadd11sus4": 290,
    "G#m11": 291,
    "Dadd13": 292,
    "Cadd11sus4": 293,
    "Dpedal": 294,
    "DmMaj7": 295,
    "C#9": 296,
    "G#aug": 297,
    "Aaug": 298,
    "G#pedal": 299,
    "A#aug7": 300,
    "B7b9": 301,
    "Baug": 302,
    "Caug7": 303,
    "B13": 304,
    "F#5": 305,
    "Cmaj11": 306,
    "C7b9": 307,
    "F#madd11": 308,
    "Cadd11": 309,
    "Cadd9sus2": 310,
    "C#aug": 311,
    "D7#11": 312,
    "C#11no3": 313,
    "G#add9sus4": 314,
    "Aadd9sus2": 315,
    "B75": 316,
    "C#add11": 317,
    "Emadd11": 318,
    "C#add13": 319,
    "F13": 320,
    "Fadd13": 321,
    "Cadd13": 322,
    "G75": 323,
    "B7no3": 324,
    "Daug7": 325,
    "G7b9": 326,
    "Dadd11": 327,
    "FaugMaj7": 328,
    "CmMaj7": 329,
    "Eadd11": 330,
    "Badd9sus2": 331,
    "G#7no3": 332,
    "Aadd13": 333,
    "D75": 334,
    "G#9": 335,
    "B11sus4": 336,
    "GaugMaj7": 337,
    "CaugMaj7": 338,
    "Gpedal": 339,
    "F7no3": 340,
    "Dmaj7sus4": 341,
    "A#aug": 342,
    "F#13": 343,
    "G#13": 344,
    "D#add11": 345,
    "Gadd11": 346,
    "Badd11": 347,
    "D#maj7sus4": 348,
    "F#9": 349,
    "A7#11": 350,
    "A#add13": 351,
    "Apedal": 352,
    "C#pedal": 353,
    "G11sus4": 354,
    "Amadd11": 355,
    "Bmadd11": 356,
    "FmMaj7": 357,
    "A#11sus4": 358,
    "Gmadd11": 359,
    "BmMaj7": 360,
    "Dadd9sus2": 361,
    "F#7b9": 362,
    "D#pedal": 363,
    "F#add13": 364,
    "A#augMaj7": 365,
    "C#aug7": 366,
    "D#13": 367,
    "D11sus4": 368,
    "D#mMaj7": 369,
    "F#pedal": 370,
    "C#7b9": 371,
    "D7no3": 372,
    "F#add11sus4": 373,
    "G#7#11": 374,
    "D#7b9": 375,
    "G#add13": 376,
    "GmMaj7": 377,
    "G#aug7": 378,
    "C#13": 379,
    "F7#11": 380,
    "C#madd11": 381,
    "G#11sus4": 382,
    "F#add11": 383,
    "D#augMaj7": 384,
    "C#11sus4": 385,
    "D13": 386,
    "E13": 387,
    "E11sus4": 388,
    "Gmaj7sus4": 389,
    "C75": 390,
    "C#9#11": 391,
    "F7b9": 392,
    "Cmaj9sus4": 393,
    "G#7b9": 394,
    "Fadd11": 395,
    "Dmadd11": 396,
    "A11sus4": 397,
    "Amaj9sus4": 398,
    "G##11no3": 399,
    "C13": 400,
    "G#augMaj7": 401,
    "G#mMaj7": 402,
    "Amaj7sus4": 403,
    "Eadd11sus4": 404,
    "Eadd9sus2": 405,
    "A#mMaj7": 406,
    "Badd13": 407,
    "Epedal": 408,
    "A#madd11": 409,
    "G7#11": 410,
    "DaugMaj7": 411,
    "Fadd9sus2": 412,
    "F#add9sus2": 413,
    "A#add9sus2": 414,
    "G#maj7sus4": 415,
    "Gmaj11": 416,
    "C#mMaj7": 417,
    "F#75": 418,
    "F75": 419,
    "Aadd11sus4": 420,
    "A7no3": 421,
    "Dmaj11": 422,
    "G7no3": 423,
    "F#mMaj7": 424,
    "F11sus4": 425,
    "G13b9": 426,
    "A#13sus4": 427,
    "D#add9sus2": 428,
    "Emaj7sus4": 429,
    "C#add11sus4": 430,
    "A#b9#11no3": 431,
    "F#maj7sus4": 432,
    "D#75": 433,
    "A13sus4": 434,
    "D#add13": 435,
    "F#maj7no3": 436,
    "F#7#11": 437,
    "EaugMaj7": 438,
    "C#add9sus2": 439,
    "A#add11sus4": 440,
    "Badd11sus4": 441,
    "G#add9sus2": 442,
    "Fmaj11": 443,
    "F#augMaj7": 444,
    "C#7#11": 445,
    "C#augMaj7": 446,
    "D#madd11": 447,
    "D#7#11": 448,
    "A#7b9": 449,
    "Dm13": 450,
    "D#aug7": 451,
    "D#11sus4": 452,
    "A#maj7sus4": 453,
    "Emaj11": 454,
    "C7no3": 455,
    "D#7no3": 456,
    "BaugMaj7": 457,
    "EmMaj7": 458,
    "B7#11": 459,
    "Fmaj7no3": 460,
    "Emaj9sus4": 461,
    "F#11sus4": 462,
    "A75": 463,
    "C#75": 464,
    "Bmaj7sus4": 465,
    "C#7no3": 466,
    "E7no3": 467,
    "F#7no3": 468,
    "G13sus4": 469,
    "Cmadd11add9": 470,
    "G#b13no3": 471,
    "A#add11": 472,
    "E7#11": 473,
    "Aadd11add9": 474,
    "Fmadd11": 475,
    "Dmaj9sus4": 476,
    "Cmaj7sus4": 477,
    "Amaj11": 478,
    "A9#11": 479,
    "A#7#11": 480,
    "A#9#11": 481,
    "D#9#11": 482,
    "C#13b9": 483,
    "AaugMaj7": 484,
    "Cmadd11": 485,
    "Cmaj13": 486,
    "Fmaj9sus4": 487,
    "Daug9": 488,
    "C13sus4": 489,
    "D13sus4": 490,
    "E13sus4": 491,
    "F#13sus4": 492,
    "Cadd11add9": 493,
    "F#maj9sus4": 494,
    "Dadd11sus4": 495,
    "D#maj11": 496,
    "F#13b9#11no3": 497,
    "G#75": 498,
    "E9#11": 499,
    "G#add11": 500,
    "G#madd11": 501,
    "Gmaj7no3": 502,
    "C7#11": 503,
    "Fadd11sus4": 504,
    "Gaug9": 505,
    "Gmadd11add9": 506,
    "D#13sus4": 507,
    "Gmaj9sus4": 508,
    "C#13b9#11no3": 509,
    "Amadd11add9": 510,
    "A7b9#11": 511,
    "Db9#11no3": 512,
    "A#7no3": 513,
    "C#maj7sus4": 514,
    "Cb9#11no3": 515,
    "Fmaj7sus4": 516,
    "A#75": 517,
    "B9#11": 518,
    "D#madd11add9": 519,
    "Bunk[6,1,4,10]": 520,
    "Aunk[7,3,4,3,4]": 521,
    "C13b9": 522,
    "Gmaj13": 523,
    "E#11no3": 524,
    "D#add11add9": 525,
    "D7b9#11": 526,
    "Aadd13add11add9": 527,
    "C9#11": 528,
    "Eunk[4,3,3,5,2,4]": 529,
    "A#maj9sus4": 530,
    "Dunk[5,2,4,10]": 531,
    "Funk[5,3,2]": 532,
    "C#unk[4,10,7]": 533,
    "Dunk[5,3,13]": 534,
    "Aunk[10,4,3]": 535,
    "G#unk[1,4,1]": 536,
    "Ab9#11no3": 537,
    "G#add11sus4": 538,
    "E13b9#11no3": 539,
    "D11b9": 540,
    "AmMaj9": 541,
    "G9#11": 542,
    "D#mMaj9": 543,
    "D9#11": 544,
    "B13b9": 545,
    "Eunk[3,3,10]": 546,
    "A13#11": 547,
    "F#unk[5,3,3,2]": 548,
    "Amaj13": 549,
    "C##11no3": 550,
    "Funk[4,4,13]": 551,
    "D#unk[11,10]": 552,
    "Fmaj13": 553,
    "G#unk[6,2,3]": 554,
    "Gunk[3,4,3,4,7]": 555,
    "Dunk[4,3,4,4,5]": 556,
    "Funk[4,2,15]": 557,
    "Gunk[3,5,13]": 558,
    "Aunk[4,6,3]": 559,
    "Badd11add9": 560,
    "Funk[4,3,4,2]": 561,
    "F13b9": 562,
    "D#unk[2,4,1,4,10]": 563,
    "Eunk[3,4,6,4]": 564,
    "Gunk[5,6,10]": 565,
    "G#13b9#11no3": 566,
    "G#unk[5,1,5]": 567,
    "Funk[4,3,3,7,4]": 568,
    "Bunk[5,3,3]": 569,
    "G#unk[4,3,4,4]": 570,
    "B13b9#11no3": 571,
    "CmMaj9": 572,
    "G7b9#11": 573,
    "FmMaj9": 574,
    "G#13sus4": 575,
    "C#add13#11no3": 576,
    "G#unk[4,3,3,5,3]": 577,
    "Gunk[4,2,5,2,4,4]": 578,
    "Funk[2,5,4,7]": 579,
    "Bmaj13": 580,
    "G#9#11": 581,
    "A#13b9": 582,
    "F7b9#11": 583,
    "Dmadd11add9": 584,
    "Cunk[2,3,2,4,10]": 585,
    "D#13b9": 586,
    "F#unk[2,5,3,8]": 587,
    "Fmadd11add9": 588,
    "G#unk[2,5,4,9]": 589,
    "Eunk[3,7,7]": 590,
    "Eunk[7,3,7,4]": 591,
    "A##11no3": 592,
    "Eunk[2,6,3]": 593,
    "Cunk[4,3,7,4,3]": 594,
    "B13sus4": 595,
    "G#11b9": 596,
    "Bunk[2,5,3,4,3]": 597,
    "C#unk[6,4,10]": 598,
    "Eadd13add11add9": 599,
    "Cunk[4,3,3,8,3]": 600,
    "C#madd11add9": 601,
    "Cunk[2,3,2,14]": 602,
    "F#unk[4,6,11]": 603,
    "F#11no3": 604,
    "Dunk[4,3,13]": 605,
    "Cunk[4,2,5,10]": 606,
    "Aunk[4,7,10]": 607,
    "Aunk[3,3,7,7]": 608,
    "F#unk[4,2,8,7]": 609,
    "Funk[11,3,3]": 610,
    "Bunk[3,3,4,3,4,3]": 611,
    "Dunk[3,7,4,3]": 612
  },
  "idx2chord": {
    "0": "<PAD>",
    "1": "<UNK>",
    "2": "G",
    "3": "C",
    "4": "D",
    "5": "F",
    "6": "A",
    "7": "E",
    "8": "A#",
    "9": "D#",
    "10": "Am",
    "11": "G#",
    "12": "B",
    "13": "Em",
    "14": "C#",
    "15": "Dm",
    "16": "F#",
    "17": "Cm",
    "18": "Bm",
    "19": "Gm",
    "20": "F#m",
    "21": "Fm",
    "22": "C#m",
    "23": "D#m",
    "24": "G#m",
    "25": "A#m",
    "26": "Am7",
    "27": "Em7",
    "28": "Dm7",
    "29": "Gm7",
    "30": "Bm7",
    "31": "Cm7",
    "32": "F#m7",
    "33": "Fm7",
    "34": "C#m7",
    "35": "G7",
    "36": "Fmaj7",
    "37": "D7",
    "38": "Cmaj7",
    "39": "C7",
    "40": "A#m7",
    "41": "A7",
    "42": "D#m7",
    "43": "G#maj7",
    "44": "G#m7",
    "45": "Dmaj7",
    "46": "Gmaj7",
    "47": "E7",
    "48": "F7",
    "49": "B7",
    "50": "A#7",
    "51": "D#maj7",
    "52": "A#maj7",
    "53": "Amaj7",
    "54": "G#7",
    "55": "Bmaj7",
    "56": "F#maj7",
    "57": "C#maj7",
    "58": "Emaj7",
    "59": "D#7",
    "60": "C#7",
    "61": "F#7",
    "62": "Cadd9",
    "63": "Gsus4",
    "64": "Dsus4",
    "65": "Asus4",
    "66": "Dadd9",
    "67": "Fadd9",
    "68": "Bdim",
    "69": "C#dim",
    "70": "Ddim",
    "71": "Aadd9",
    "72": "Edim",
    "73": "F#dim",
    "74": "Gadd9",
    "75": "Csus4",
    "76": "Fsus4",
    "77": "G#dim",
    "78": "Esus4",
    "79": "G#add9",
    "80": "C#sus4",
    "81": "D#dim",
    "82": "D#add9",
    "83": "Badd9",
    "84": "A#sus4",
    "85": "A#add9",
    "86": "Bsus4",
    "87": "Cdim",
    "88": "Gdim",
    "89": "G#sus4",
    "90": "C#add9",
    "91": "Dm7b5",
    "92": "Em7b5",
    "93": "Asus2",
    "94": "Bm7b5",
    "95": "F#m7b5",
    "96": "Adim",
    "97": "Esus2",
    "98": "Fdim",
    "99": "A#dim",
    "100": "D#sus4",
    "101": "Eadd9",
    "102": "Csus2",
    "103": "Am7b5",
    "104": "Dsus2",
    "105": "Bsus2",
    "106": "Gsus2",
    "107": "Fsus2",
    "108": "G7sus4",
    "109": "F#sus4",
    "110": "F#add9",
    "111": "D#m7b5",
    "112": "D#sus2",
    "113": "A#sus2",
    "114": "C#m7b5",
    "115": "C#sus2",
    "116": "D7sus4",
    "117": "C5",
    "118": "A7sus4",
    "119": "Amadd9",
    "120": "Cmaj9",
    "121": "Gm7b5",
    "122": "C7sus4",
    "123": "Em9",
    "124": "Fm7b5",
    "125": "D#7sus4",
    "126": "B7sus4",
    "127": "D9sus2",
    "128": "Gmadd9",
    "129": "E7sus4",
    "130": "A#m7b5",
    "131": "G11",
    "132": "A#7sus4",
    "133": "G#m7b5",
    "134": "Cm7b5",
    "135": "D#maj9",
    "136": "Fm9",
    "137": "G5",
    "138": "C11",
    "139": "D#m9",
    "140": "Am9",
    "141": "Gm9",
    "142": "G#7sus4",
    "143": "G#sus2",
    "144": "Fmaj9",
    "145": "F#madd9",
    "146": "E9sus2",
    "147": "A11",
    "148": "F#sus2",
    "149": "Dmadd9",
    "150": "Gmaj9",
    "151": "D11",
    "152": "A#madd9",
    "153": "C#maj9",
    "154": "C9sus2",
    "155": "Dmaj9",
    "156": "F#7sus4",
    "157": "Cm9",
    "158": "E11",
    "159": "Dm11",
    "160": "Fmaj9sus2",
    "161": "Dm9",
    "162": "F7sus4",
    "163": "Fmadd9",
    "164": "Emaj9",
    "165": "C#7sus4",
    "166": "Cmadd9",
    "167": "F#m9",
    "168": "F#dim7",
    "169": "D#9sus2",
    "170": "F#m11",
    "171": "Cm11",
    "172": "Am11",
    "173": "Bm11",
    "174": "Amaj9",
    "175": "G#m9",
    "176": "Em11",
    "177": "Dmaj9sus2",
    "178": "Cmaj9sus2",
    "179": "G#maj9",
    "180": "D#madd9",
    "181": "A9sus2",
    "182": "Bdim7",
    "183": "A#11",
    "184": "Edim7",
    "185": "D#maj9sus2",
    "186": "C9",
    "187": "A#m9",
    "188": "C#dim7",
    "189": "B11",
    "190": "F5",
    "191": "Fm11",
    "192": "A#maj9",
    "193": "C#m9",
    "194": "A#9sus2",
    "195": "D9",
    "196": "F#maj9",
    "197": "Bmadd9",
    "198": "C#9sus2",
    "199": "G9sus2",
    "200": "D#11",
    "201": "G#dim7",
    "202": "E5",
    "203": "G#9sus2",
    "204": "C#11",
    "205": "F11",
    "206": "D#dim7",
    "207": "F9sus2",
    "208": "B9sus2",
    "209": "Emadd9",
    "210": "Dadd9sus4",
    "211": "Gmaj9sus2",
    "212": "Adim7",
    "213": "C#m11",
    "214": "F9",
    "215": "Cpedal",
    "216": "G#madd9",
    "217": "Gadd9sus4",
    "218": "Bm9",
    "219": "C#madd9",
    "220": "A#maj9sus2",
    "221": "A5",
    "222": "Cadd9sus4",
    "223": "A#dim7",
    "224": "Amaj9sus2",
    "225": "Gm11",
    "226": "D#m11",
    "227": "G#11",
    "228": "Bmaj9",
    "229": "A#m11",
    "230": "Caug",
    "231": "D#9",
    "232": "G9",
    "233": "Aadd9sus4",
    "234": "Gdim7",
    "235": "D5",
    "236": "Fadd9sus4",
    "237": "Ddim7",
    "238": "Fdim7",
    "239": "F#9sus2",
    "240": "Eadd9sus4",
    "241": "B5",
    "242": "Emaj9sus2",
    "243": "E9",
    "244": "D#5",
    "245": "Cdim7",
    "246": "A9",
    "247": "F#maj9sus2",
    "248": "A#add9sus4",
    "249": "C#add9sus4",
    "250": "G#maj9sus2",
    "251": "Bmaj9sus2",
    "252": "A#9",
    "253": "Baug7",
    "254": "Gaug",
    "255": "C#maj9sus2",
    "256": "B9",
    "257": "A13",
    "258": "Faug",
    "259": "Daug",
    "260": "Aaug7",
    "261": "Fpedal",
    "262": "A#5",
    "263": "D7b9",
    "264": "Bpedal",
    "265": "Badd9sus4",
    "266": "E7b9",
    "267": "F#11",
    "268": "A#13",
    "269": "F#aug",
    "270": "A#pedal",
    "271": "C#5",
    "272": "Gaug7",
    "273": "AmMaj7",
    "274": "F#add9sus4",
    "275": "G#5",
    "276": "D#aug",
    "277": "C11sus4",
    "278": "Eaug",
    "279": "Gadd13",
    "280": "Faug7",
    "281": "Aadd11",
    "282": "D#add9sus4",
    "283": "Gadd9sus2",
    "284": "G13",
    "285": "Eadd13",
    "286": "A7b9",
    "287": "Eaug7",
    "288": "F#aug7",
    "289": "E75",
    "290": "Gadd11sus4",
    "291": "G#m11",
    "292": "Dadd13",
    "293": "Cadd11sus4",
    "294": "Dpedal",
    "295": "DmMaj7",
    "296": "C#9",
    "297": "G#aug",
    "298": "Aaug",
    "299": "G#pedal",
    "300": "A#aug7",
    "301": "B7b9",
    "302": "Baug",
    "303": "Caug7",
    "304": "B13",
    "305": "F#5",
    "306": "Cmaj11",
    "307": "C7b9",
    "308": "F#madd11",
    "309": "Cadd11",
    "310": "Cadd9sus2",
    "311": "C#aug",
    "312": "D7#11",
    "313": "C#11no3",
    "314": "G#add9sus4",
    "315": "Aadd9sus2",
    "316": "B75",
    "317": "C#add11",
    "318": "Emadd11",
    "319": "C#add13",
    "320": "F13",
    "321": "Fadd13",
    "322": "Cadd13",
    "323": "G75",
    "324": "B7no3",
    "325": "Daug7",
    "326": "G7b9",
    "327": "Dadd11",
    "328": "FaugMaj7",
    "329": "CmMaj7",
    "330": "Eadd11",
    "331": "Badd9sus2",
    "332": "G#7no3",
    "333": "Aadd13",
    "334": "D75",
    "335": "G#9",
    "336": "B11sus4",
    "337": "GaugMaj7",
    "338": "CaugMaj7",
    "339": "Gpedal",
    "340": "F7no3",
    "341": "Dmaj7sus4",
    "342": "A#aug",
    "343": "F#13",
    "344": "G#13",
    "345": "D#add11",
    "346": "Gadd11",
    "347": "Badd11",
    "348": "D#maj7sus4",
    "349": "F#9",
    "350": "A7#11",
    "351": "A#add13",
    "352": "Apedal",
    "353": "C#pedal",
    "354": "G11sus4",
    "355": "Amadd11",
    "356": "Bmadd11",
    "357": "FmMaj7",
    "358": "A#11sus4",
    "359": "Gmadd11",
    "360": "BmMaj7",
    "361": "Dadd9sus2",
    "362": "F#7b9",
    "363": "D#pedal",
    "364": "F#add13",
    "365": "A#augMaj7",
    "366": "C#aug7",
    "367": "D#13",
    "368": "D11sus4",
    "369": "D#mMaj7",
    "370": "F#pedal",
    "371": "C#7b9",
    "372": "D7no3",
    "373": "F#add11sus4",
    "374": "G#7#11",
    "375": "D#7b9",
    "376": "G#add13",
    "377": "GmMaj7",
    "378": "G#aug7",
    "379": "C#13",
    "380": "F7#11",
    "381": "C#madd11",
    "382": "G#11sus4",
    "383": "F#add11",
    "384": "D#augMaj7",
    "385": "C#11sus4",
    "386": "D13",
    "387": "E13",
    "388": "E11sus4",
    "389": "Gmaj7sus4",
    "390": "C75",
    "391": "C#9#11",
    "392": "F7b9",
    "393": "Cmaj9sus4",
    "394": "G#7b9",
    "395": "Fadd11",
    "396": "Dmadd11",
    "397": "A11sus4",
    "398": "Amaj9sus4",
    "399": "G##11no3",
    "400": "C13",
    "401": "G#augMaj7",
    "402": "G#mMaj7",
    "403": "Amaj7sus4",
    "404": "Eadd11sus4",
    "405": "Eadd9sus2",
    "406": "A#mMaj7",
    "407": "Badd13",
    "408": "Epedal",
    "409": "A#madd11",
    "410": "G7#11",
    "411": "DaugMaj7",
    "412": "Fadd9sus2",
    "413": "F#add9sus2",
    "414": "A#add9sus2",
    "415": "G#maj7sus4",
    "416": "Gmaj11",
    "417": "C#mMaj7",
    "418": "F#75",
    "419": "F75",
    "420": "Aadd11sus4",
    "421": "A7no3",
    "422": "Dmaj11",
    "423": "G7no3",
    "424": "F#mMaj7",
    "425": "F11sus4",
    "426": "G13b9",
    "427": "A#13sus4",
    "428": "D#add9sus2",
    "429": "Emaj7sus4",
    "430": "C#add11sus4",
    "431": "A#b9#11no3",
    "432": "F#maj7sus4",
    "433": "D#75",
    "434": "A13sus4",
    "435": "D#add13",
    "436": "F#maj7no3",
    "437": "F#7#11",
    "438": "EaugMaj7",
    "439": "C#add9sus2",
    "440": "A#add11sus4",
    "441": "Badd11sus4",
    "442": "G#add9sus2",
    "443": "Fmaj11",
    "444": "F#augMaj7",
    "445": "C#7#11",
    "446": "C#augMaj7",
    "447": "D#madd11",
    "448": "D#7#11",
    "449": "A#7b9",
    "450": "Dm13",
    "451": "D#aug7",
    "452": "D#11sus4",
    "453": "A#maj7sus4",
    "454": "Emaj11",
    "455": "C7no3",
    "456": "D#7no3",
    "457": "BaugMaj7",
    "458": "EmMaj7",
    "459": "B7#11",
    "460": "Fmaj7no3",
    "461": "Emaj9sus4",
    "462": "F#11sus4",
    "463": "A75",
    "464": "C#75",
    "465": "Bmaj7sus4",
    "466": "C#7no3",
    "467": "E7no3",
    "468": "F#7no3",
    "469": "G13sus4",
    "470": "Cmadd11add9",
    "471": "G#b13no3",
    "472": "A#add11",
    "473": "E7#11",
    "474": "Aadd11add9",
    "475": "Fmadd11",
    "476": "Dmaj9sus4",
    "477": "Cmaj7sus4",
    "478": "Amaj11",
    "479": "A9#11",
    "480": "A#7#11",
    "481": "A#9#11",
    "482": "D#9#11",
    "483": "C#13b9",
    "484": "AaugMaj7",
    "485": "Cmadd11",
    "486": "Cmaj13",
    "487": "Fmaj9sus4",
    "488": "Daug9",
    "489": "C13sus4",
    "490": "D13sus4",
    "491": "E13sus4",
    "492": "F#13sus4",
    "493": "Cadd11add9",
    "494": "F#maj9sus4",
    "495": "Dadd11sus4",
    "496": "D#maj11",
    "497": "F#13b9#11no3",
    "498": "G#75",
    "499": "E9#11",
    "500": "G#add11",
    "501": "G#madd11",
    "502": "Gmaj7no3",
    "503": "C7#11",
    "504": "Fadd11sus4",
    "505": "Gaug9",
    "506": "Gmadd11add9",
    "507": "D#13sus4",
    "508": "Gmaj9sus4",
    "509": "C#13b9#11no3",
    "510": "Amadd11add9",
    "511": "A7b9#11",
    "512": "Db9#11no3",
    "513": "A#7no3",
    "514": "C#maj7sus4",
    "515": "Cb9#11no3",
    "516": "Fmaj7sus4",
    "517": "A#75",
    "518": "B9#11",
    "519": "D#madd11add9",
    "520": "Bunk[6,1,4,10]",
    "521": "Aunk[7,3,4,3,4]",
    "522": "C13b9",
    "523": "Gmaj13",
    "524": "E#11no3",
    "525": "D#add11add9",
    "526": "D7b9#11",
    "527": "Aadd13add11add9",
    "528": "C9#11",
    "529": "Eunk[4,3,3,5,2,4]",
    "530": "A#maj9sus4",
    "531": "Dunk[5,2,4,10]",
    "532": "Funk[5,3,2]",
    "533": "C#unk[4,10,7]",
    "534": "Dunk[5,3,13]",
    "535": "Aunk[10,4,3]",
    "536": "G#unk[1,4,1]",
    "537": "Ab9#11no3",
    "538": "G#add11sus4",
    "539": "E13b9#11no3",
    "540": "D11b9",
    "541": "AmMaj9",
    "542": "G9#11",
    "543": "D#mMaj9",
    "544": "D9#11",
    "545": "B13b9",
    "546": "Eunk[3,3,10]",
    "547": "A13#11",
    "548": "F#unk[5,3,3,2]",
    "549": "Amaj13",
    "550": "C##11no3",
    "551": "Funk[4,4,13]",
    "552": "D#unk[11,10]",
    "553": "Fmaj13",
    "554": "G#unk[6,2,3]",
    "555": "Gunk[3,4,3,4,7]",
    "556": "Dunk[4,3,4,4,5]",
    "557": "Funk[4,2,15]",
    "558": "Gunk[3,5,13]",
    "559": "Aunk[4,6,3]",
    "560": "Badd11add9",
    "561": "Funk[4,3,4,2]",
    "562": "F13b9",
    "563": "D#unk[2,4,1,4,10]",
    "564": "Eunk[3,4,6,4]",
    "565": "Gunk[5,6,10]",
    "566": "G#13b9#11no3",
    "567": "G#unk[5,1,5]",
    "568": "Funk[4,3,3,7,4]",
    "569": "Bunk[5,3,3]",
    "570": "G#unk[4,3,4,4]",
    "571": "B13b9#11no3",
    "572": "CmMaj9",
    "573": "G7b9#11",
    "574": "FmMaj9",
    "575": "G#13sus4",
    "576": "C#add13#11no3",
    "577": "G#unk[4,3,3,5,3]",
    "578": "Gunk[4,2,5,2,4,4]",
    "579": "Funk[2,5,4,7]",
    "580": "Bmaj13",
    "581": "G#9#11",
    "582": "A#13b9",
    "583": "F7b9#11",
    "584": "Dmadd11add9",
    "585": "Cunk[2,3,2,4,10]",
    "586": "D#13b9",
    "587": "F#unk[2,5,3,8]",
    "588": "Fmadd11add9",
    "589": "G#unk[2,5,4,9]",
    "590": "Eunk[3,7,7]",
    "591": "Eunk[7,3,7,4]",
    "592": "A##11no3",
    "593": "Eunk[2,6,3]",
    "594": "Cunk[4,3,7,4,3]",
    "595": "B13sus4",
    "596": "G#11b9",
    "597": "Bunk[2,5,3,4,3]",
    "598": "C#unk[6,4,10]",
    "599": "Eadd13add11add9",
    "600": "Cunk[4,3,3,8,3]",
    "601": "C#madd11add9",
    "602": "Cunk[2,3,2,14]",
    "603": "F#unk[4,6,11]",
    "604": "F#11no3",
    "605": "Dunk[4,3,13]",
    "606": "Cunk[4,2,5,10]",
    "607": "Aunk[4,7,10]",
    "608": "Aunk[3,3,7,7]",
    "609": "F#unk[4,2,8,7]",
    "610": "Funk[11,3,3]",
    "611": "Bunk[3,3,4,3,4,3]",
    "612": "Dunk[3,7,4,3]"
  }
}