{
  "chord2idx": {
    "<PAD>": 0,
    "<UNK>": 1,
    "I": 2,
    "im": 3,
    "V": 4,
    "IV": 5,
    "bVII": 6,
    "bVI": 7,
    "vim": 8,
    "bIII": 9,
    "ivm": 10,
    "iim": 11,
    "vm": 12,
    "V7": 13,
    "im7": 14,
    "iiim": 15,
    "iim7": 16,
    "bVImaj7": 17,
    "II": 18,
    "vim7": 19,
    "vm7": 20,
    "IVmaj7": 21,
    "ivm7": 22,
    "Imaj7": 23,
    "iiim7": 24,
    "VI": 25,
    "bII": 26,
    "III": 27,
    "I7": 28,
    "Vsus4": 29,
    "II7": 30,
    "Isus4": 31,
    "bIIImaj7": 32,
    "iim7b5": 33,
    "viidim": 34,
    "bVII7": 35,
    "IV7": 36,
    "III7": 37,
    "VII": 38,
    "Isus2": 39,
    "IVsus2": 40,
    "bV": 41,
    "iidim": 42,
    "VI7": 43,
    "bIImaj7": 44,
    "bviim": 45,
    "bVIIsus4": 46,
    "bvdim": 47,
    "idim": 48,
    "vim7b5": 49,
    "viim": 50,
    "bVIImaj7": 51,
    "biiim": 52,
    "bviim7": 53,
    "bVI7": 54,
    "vidim": 55,
    "bIII7": 56,
    "IVsus4": 57,
    "Imaj9": 58,
    "IVmaj9": 59,
    "bVImaj9": 60,
    "viim7b5": 61,
    "viim7": 62,
    "bvim": 63,
    "iiidim": 64,
    "bVIIsus2": 65,
    "bVIsus2": 66,
    "bvm7b5": 67,
    "bvdim7": 68,
    "biim": 69,
    "Vsus2": 70,
    "bvidim": 71,
    "IIsus4": 72,
    "VII7": 73,
    "biidim": 74,
    "vdim": 75,
    "V9": 76,
    "viidim7": 77,
    "bIIIsus2": 78,
    "bIIImaj9": 79,
    "biiim7": 80,
    "Vmaj7": 81,
    "bvm": 82,
    "bVmaj7": 83,
    "VIsus4": 84,
    "bIIIsus4": 85,
    "vm7b5": 86,
    "im7b5": 87,
    "IIIsus4": 88,
    "bII7": 89,
    "bvim7": 90,
    "biiidim": 91,
    "iiim7b5": 92,
    "Iaug": 93,
    "IIImaj7": 94,
    "bV7": 95,
    "IV9": 96,
    "biidim7": 97,
    "II9": 98,
    "VIImaj7": 99,
    "iiidim7": 100,
    "bIIIaug": 101,
    "VIsus2": 102,
    "bVII9": 103,
    "vidim7": 104,
    "ivdim": 105,
    "IIsus2": 106,
    "bVIImaj9": 107,
    "Vaug": 108,
    "bVIaug": 109,
    "bvidim7": 110,
    "IImaj7": 111,
    "bvm7": 112,
    "VImaj7": 113,
    "bIImaj9": 114,
    "I9": 115,
    "ImMaj7": 116,
    "Vaug7": 117,
    "bviidim": 118,
    "ivm7b5": 119,
    "IVmMaj7": 120,
    "biim7": 121,
    "biiidim7": 122,
    "bIII9": 123,
    "bIIsus2": 124,
    "bVIsus4": 125,
    "VIIsus4": 126,
    "biim7b5": 127,
    "VI9": 128,
    "bvim7b5": 129,
    "Vmaj9": 130,
    "bVI9": 131,
    "bII9": 132,
    "bIIsus4": 133,
    "bVIIaug": 134,
    "idim7": 135,
    "IVaug": 136,
    "bviim7b5": 137,
    "vdim7": 138,
    "iidim7": 139,
    "bVmaj9": 140,
    "VImMaj7": 141,
    "IIIsus2": 142,
    "IImMaj7": 143,
    "biiim7b5": 144,
    "bVImMaj7": 145,
    "VImaj9": 146,
    "VIIaug": 147,
    "ivdim7": 148,
    "bIIaug": 149,
    "VIImaj9": 150,
    "bVsus2": 151,
    "bVsus4": 152,
    "bviidim7": 153,
    "Iaug7": 154,
    "VIaug": 155,
    "III9": 156,
    "IImaj9": 157,
    "IIIaug": 158,
    "VIaug7": 159,
    "bVIIaug7": 160,
    "bIImMaj7": 161,
    "bVaug7": 162,
    "VIIsus2": 163,
    "bV9": 164,
    "bVaug": 165,
    "IIIaug7": 166,
    "IIImaj9": 167,
    "bVIaug7": 168,
    "IIImMaj7": 169,
    "VIIaug7": 170,
    "VII9": 171,
    "IIaug7": 172,
    "IIaug": 173,
    "VmMaj7": 174,
    "bVIImMaj7": 175,
    "bIIImMaj7": 176,
    "bVmMaj7": 177
  },
  "idx2chord": {
    "0": "<PAD>",
    "1": "<UNK>",
    "2": "I",
    "3": "im",
    "4": "V",
    "5": "IV",
    "6": "bVII",
    "7": "bVI",
    "8": "vim",
    "9": "bIII",
    "10": "ivm",
    "11": "iim",
    "12": "vm",
    "13": "V7",
    "14": "im7",
    "15": "iiim",
    "16": "iim7",
    "17": "bVImaj7",
    "18": "II",
    "19": "vim7",
    "20": "vm7",
    "21": "IVmaj7",
    "22": "ivm7",
    "23": "Imaj7",
    "24": "iiim7",
    "25": "VI",
    "26": "bII",
    "27": "III",
    "28": "I7",
    "29": "Vsus4",
    "30": "II7",
    "31": "Isus4",
    "32": "bIIImaj7",
    "33": "iim7b5",
    "34": "viidim",
    "35": "bVII7",
    "36": "IV7",
    "37": "III7",
    "38": "VII",
    "39": "Isus2",
    "40": "IVsus2",
    "41": "bV",
    "42": "iidim",
    "43": "VI7",
    "44": "bIImaj7",
    "45": "bviim",
    "46": "bVIIsus4",
    "47": "bvdim",
    "48": "idim",
    "49": "vim7b5",
    "50": "viim",
    "51": "bVIImaj7",
    "52": "biiim",
    "53": "bviim7",
    "54": "bVI7",
    "55": "vidim",
    "56": "bIII7",
    "57": "IVsus4",
    "58": "Imaj9",
    "59": "IVmaj9",
    "60": "bVImaj9",
    "61": "viim7b5",
    "62": "viim7",
    "63": "bvim",
    "64": "iiidim",
    "65": "bVIIsus2",
    "66": "bVIsus2",
    "67": "bvm7b5",
    "68": "bvdim7",
    "69": "biim",
    "70": "Vsus2",
    "71": "bvidim",
    "72": "IIsus4",
    "73": "VII7",
    "74": "biidim",
    "75": "vdim",
    "76": "V9",
    "77": "viidim7",
    "78": "bIIIsus2",
    "79": "bIIImaj9",
    "80": "biiim7",
    "81": "Vmaj7",
    "82": "bvm",
    "83": "bVmaj7",
    "84": "VIsus4",
    "85": "bIIIsus4",
    "86": "vm7b5",
    "87": "im7b5",
    "88": "IIIsus4",
    "89": "bII7",
    "90": "bvim7",
    "91": "biiidim",
    "92": "iiim7b5",
    "93": "Iaug",
    "94": "IIImaj7",
    "95": "bV7",
    "96": "IV9",
    "97": "biidim7",
    "98": "II9",
    "99": "VIImaj7",
    "100": "iiidim7",
    "101": "bIIIaug",
    "102": "VIsus2",
    "103": "bVII9",
    "104": "vidim7",
    "105": "ivdim",
    "106": "IIsus2",
    "107": "bVIImaj9",
    "108": "Vaug",
    "109": "bVIaug",
    "110": "bvidim7",
    "111": "IImaj7",
    "112": "bvm7",
    "113": "VImaj7",
    "114": "bIImaj9",
    "115": "I9",
    "116": "ImMaj7",
    "117": "Vaug7",
    "118": "bviidim",
    "119": "ivm7b5",
    "120": "IVmMaj7",
    "121": "biim7",
    "122": "biiidim7",
    "123": "bIII9",
    "124": "bIIsus2",
    "125": "bVIsus4",
    "126": "VIIsus4",
    "127": "biim7b5",
    "128": "VI9",
    "129": "bvim7b5",
    "130": "Vmaj9",
    "131": "bVI9",
    "132": "bII9",
    "133": "bIIsus4",
    "134": "bVIIaug",
    "135": "idim7",
    "136": "IVaug",
    "137": "bviim7b5",
    "138": "vdim7",
    "139": "iidim7",
    "140": "bVmaj9",
    "141": "VImMaj7",
    "142": "IIIsus2",
    "143": "IImMaj7",
    "144": "biiim7b5",
    "145": "bVImMaj7",
    "146": "VImaj9",
    "147": "VIIaug",
    "148": "ivdim7",
    "149": "bIIaug",
    "150": "VIImaj9",
    "151": "bVsus2",
    "152": "bVsus4",
    "153": "bviidim7",
    "154": "Iaug7",
    "155": "VIaug",
    "156": "III9",
    "157": "IImaj9",
    "158": "IIIaug",
    "159": "VIaug7",
    "160": "bVIIaug7",
    "161": "bIImMaj7",
    "162": "bVaug7",
    "163": "VIIsus2",
    "164": "bV9",
    "165": "bVaug",
    "166": "IIIaug7",
    "167": "IIImaj9",
    "168": "bVIaug7",
    "169": "IIImMaj7",
    "170": "VIIaug7",
    "171": "VII9",
    "172": "IIaug7",
    "173": "IIaug",
    "174": "VmMaj7",
    "175": "bVIImMaj7",
    "176": "bIIImMaj7",
    "177": "bVmMaj7"
  }
}