{
  "chord2idx": {
    "<PAD>": 0,
    "<UNK>": 1,
    "G": 2,
    "C": 3,
    "D": 4,
    "F": 5,
    "A": 6,
    "E": 7,
    "A#": 8,
    "D#": 9,
    "Am": 10,
    "G#": 11,
    "B": 12,
    "Em": 13,
    "C#": 14,
    "Dm": 15,
    "F#": 16,
    "Cm": 17,
    "Bm": 18,
    "Gm": 19,
    "F#m": 20,
    "Fm": 21,
    "C#m": 22,
    "D#m": 23,
    "G#m": 24,
    "A#m": 25,
    "Am7": 26,
    "Em7": 27,
    "Dm7": 28,
    "Gm7": 29,
    "Bm7": 30,
    "Cm7": 31,
    "F#m7": 32,
    "Fm7": 33,
    "C#m7": 34,
    "G7": 35,
    "Fmaj7": 36,
    "D7": 37,
    "Cmaj7": 38,
    "C7": 39,
    "A#m7": 40,
    "A7": 41,
    "D#m7": 42,
    "G#maj7": 43,
    "G#m7": 44,
    "Dmaj7": 45,
    "Gmaj7": 46,
    "E7": 47,
    "B7": 48,
    "F7": 49,
    "A#7": 50,
    "D#maj7": 51,
    "A#maj7": 52,
    "Amaj7": 53,
    "G#7": 54,
    "Bmaj7": 55,
    "F#maj7": 56,
    "C#maj7": 57,
    "Emaj7": 58,
    "D#7": 59,
    "C#7": 60,
    "F#7": 61,
    "Cadd9": 62,
    "Gsus4": 63,
    "Dsus4": 64,
    "Asus4": 65,
    "Dadd9": 66,
    "Fadd9": 67,
    "Bdim": 68,
    "C#dim": 69,
    "Ddim": 70,
    "Aadd9": 71,
    "Edim": 72,
    "F#dim": 73,
    "Gadd9": 74,
    "Csus4": 75,
    "Fsus4": 76,
    "G#dim": 77,
    "Esus4": 78,
    "G#add9": 79,
    "C#sus4": 80,
    "D#dim": 81,
    "D#add9": 82,
    "Badd9": 83,
    "A#sus4": 84,
    "A#add9": 85,
    "Bsus4": 86,
    "Cdim": 87,
    "Gdim": 88,
    "G#sus4": 89,
    "C#add9": 90,
    "Dm7b5": 91,
    "Em7b5": 92,
    "Asus2": 93,
    "Bm7b5": 94,
    "F#m7b5": 95,
    "Adim": 96,
    "Esus2": 97,
    "Fdim": 98,
    "A#dim": 99,
    "D#sus4": 100,
    "Eadd9": 101,
    "Csus2": 102,
    "Am7b5": 103,
    "Dsus2": 104,
    "Bsus2": 105,
    "Gsus2": 106,
    "Fsus2": 107,
    "G7sus4": 108,
    "F#sus4": 109,
    "F#add9": 110,
    "D#m7b5": 111,
    "D#sus2": 112,
    "A#sus2": 113,
    "C#m7b5": 114,
    "C#sus2": 115,
    "C5": 116,
    "Amadd9": 117,
    "D7sus4": 118,
    "Cmaj9": 119,
    "Gm7b5": 120,
    "A7sus4": 121,
    "C7sus4": 122,
    "Fm7b5": 123,
    "Em9": 124,
    "Gmadd9": 125,
    "D9sus2": 126,
    "D#7sus4": 127,
    "A#m7b5": 128,
    "G11": 129,
    "A#7sus4": 130,
    "B7sus4": 131,
    "G#m7b5": 132,
    "Cm7b5": 133,
    "D#maj9": 134,
    "E7sus4": 135,
    "Fm9": 136,
    "G5": 137,
    "C11": 138,
    "D#m9": 139,
    "Am9": 140,
    "Gm9": 141,
    "G#7sus4": 142,
    "G#sus2": 143,
    "Fmaj9": 144,
    "F#madd9": 145,
    "E9sus2": 146,
    "A11": 147,
    "F#sus2": 148,
    "Dmadd9": 149,
    "Gmaj9": 150,
    "D11": 151,
    "A#madd9": 152,
    "C#maj9": 153,
    "C9sus2": 154,
    "Cm9": 155,
    "E11": 156,
    "Dm11": 157,
    "Fmaj9sus2": 158,
    "F#7sus4": 159,
    "Dmaj9": 160,
    "Dm9": 161,
    "Fmadd9": 162,
    "Emaj9": 163,
    "Cmadd9": 164,
    "F#m9": 165,
    "F7sus4": 166,
    "F#dim7": 167,
    "F#m11": 168,
    "Cm11": 169,
    "D#9sus2": 170,
    "C#7sus4": 171,
    "Am11": 172,
    "Bm11": 173,
    "Amaj9": 174,
    "Em11": 175,
    "G#m9": 176,
    "Dmaj9sus2": 177,
    "Cmaj9sus2": 178,
    "G#maj9": 179,
    "D#madd9": 180,
    "A9sus2": 181,
    "Bdim7": 182,
    "A#11": 183,
    "Edim7": 184,
    "D#maj9sus2": 185,
    "C9": 186,
    "A#m9": 187,
    "C#dim7": 188,
    "B11": 189,
    "F5": 190,
    "Fm11": 191,
    "A#maj9": 192,
    "A#9sus2": 193,
    "C#m9": 194,
    "D9": 195,
    "F#maj9": 196,
    "Bmadd9": 197,
    "C#9sus2": 198,
    "G9sus2": 199,
    "D#11": 200,
    "G#dim7": 201,
    "E5": 202,
    "C#11": 203,
    "F11": 204,
    "G#9sus2": 205,
    "D#dim7": 206,
    "F9sus2": 207,
    "B9sus2": 208,
    "Emadd9": 209,
    "Dadd9sus4": 210,
    "Gmaj9sus2": 211,
    "Adim7": 212,
    "C#m11": 213,
    "F9": 214,
    "Cunk[empty]": 215,
    "G#madd9": 216,
    "Gadd9sus4": 217,
    "Bm9": 218,
    "C#madd9": 219,
    "A#maj9sus2": 220,
    "A5": 221,
    "Cadd9sus4": 222,
    "A#dim7": 223,
    "Amaj9sus2": 224,
    "Gm11": 225,
    "D#m11": 226,
    "G#11": 227,
    "Bmaj9": 228,
    "A#m11": 229,
    "Caug": 230,
    "D#9": 231,
    "G9": 232,
    "Gdim7": 233,
    "D5": 234,
    "Fadd9sus4": 235,
    "Ddim7": 236,
    "Fdim7": 237,
    "F#9sus2": 238,
    "Aadd9sus4": 239,
    "Eadd9sus4": 240,
    "B5": 241,
    "Emaj9sus2": 242,
    "D#5": 243,
    "Cdim7": 244,
    "A9": 245,
    "F#maj9sus2": 246,
    "A#add9sus4": 247,
    "C#add9sus4": 248,
    "G#maj9sus2": 249,
    "Bmaj9sus2": 250,
    "E9": 251,
    "A#9": 252,
    "Baug7": 253,
    "Gaug": 254,
    "C#maj9sus2": 255,
    "B9": 256,
    "A13": 257,
    "Faug": 258,
    "Daug": 259,
    "Aaug7": 260,
    "Funk[empty]": 261,
    "A#5": 262,
    "D7b9": 263,
    "Bunk[empty]": 264,
    "E7b9": 265,
    "Badd9sus4": 266,
    "F#11": 267,
    "A#13": 268,
    "F#aug": 269,
    "A#unk[empty]": 270,
    "C#5": 271,
    "Gaug7": 272,
    "F#add9sus4": 273,
    "G#5": 274,
    "D#aug": 275,
    "C11sus4": 276,
    "Eaug": 277,
    "Gadd13": 278,
    "Faug7": 279,
    "Aadd11": 280,
    "D#add9sus4": 281,
    "G13": 282,
    "Eadd13": 283,
    "A7b9": 284,
    "Eaug7": 285,
    "AmMaj7": 286,
    "F#aug7": 287,
    "E75": 288,
    "Gadd9sus2": 289,
    "G#m11": 290,
    "Dadd13": 291,
    "Dunk[empty]": 292,
    "Gunk[5]": 293,
    "DmMaj7": 294,
    "C#9": 295,
    "G#aug": 296,
    "Aaug": 297,
    "Cunk[5]": 298,
    "G#unk[empty]": 299,
    "A#aug7": 300,
    "B7b9": 301,
    "Baug": 302,
    "Caug7": 303,
    "B13": 304,
    "D#unk[4,6]": 305,
    "F#5": 306,
    "Cmaj11": 307,
    "C7b9": 308,
    "Cadd11": 309,
    "C#aug": 310,
    "G#add9sus4": 311,
    "Aadd9sus2": 312,
    "B75": 313,
    "Cadd9sus2": 314,
    "C#add11": 315,
    "Dunk[4,2,4]": 316,
    "F13": 317,
    "Fadd13": 318,
    "F#madd11": 319,
    "G75": 320,
    "Bunk[1,5,4]": 321,
    "Daug7": 322,
    "G7b9": 323,
    "Dadd11": 324,
    "FaugMaj7": 325,
    "CmMaj7": 326,
    "Eadd11": 327,
    "Cunk[6,2]": 328,
    "Badd9sus2": 329,
    "Aadd13": 330,
    "Cadd13": 331,
    "Emadd11": 332,
    "D75": 333,
    "G#9": 334,
    "B11sus4": 335,
    "GaugMaj7": 336,
    "Gunk[3]": 337,
    "CaugMaj7": 338,
    "Gunk[empty]": 339,
    "Funk[1,5,4]": 340,
    "Dmaj7sus4": 341,
    "A#aug": 342,
    "F#13": 343,
    "G#13": 344,
    "Funk[4,6]": 345,
    "D#add11": 346,
    "Gadd11": 347,
    "D#maj7sus4": 348,
    "F#9": 349,
    "A#add13": 350,
    "Aunk[empty]": 351,
    "C#unk[empty]": 352,
    "Amadd11": 353,
    "Bmadd11": 354,
    "FmMaj7": 355,
    "Gmadd11": 356,
    "G11sus4": 357,
    "BmMaj7": 358,
    "F#7b9": 359,
    "Aunk[4,2,4]": 360,
    "D#unk[empty]": 361,
    "C#unk[4,17]": 362,
    "Eunk[3]": 363,
    "A#augMaj7": 364,
    "C#aug7": 365,
    "D#13": 366,
    "Badd11": 367,
    "Dadd9sus2": 368,
    "D#mMaj7": 369,
    "F#unk[empty]": 370,
    "C#7b9": 371,
    "F#unk[5,1]": 372,
    "D11sus4": 373,
    "D#7b9": 374,
    "G#add13": 375,
    "GmMaj7": 376,
    "G#aug7": 377,
    "C#13": 378,
    "F#unk[4,17]": 379,
    "Aunk[3]": 380,
    "Dunk[3]": 381,
    "C#madd11": 382,
    "G#11sus4": 383,
    "F#add11": 384,
    "D#augMaj7": 385,
    "D13": 386,
    "E13": 387,
    "F7#11": 388,
    "E11sus4": 389,
    "Gmaj7sus4": 390,
    "C75": 391,
    "F7b9": 392,
    "Funk[4]": 393,
    "Cmaj9sus4": 394,
    "G#7b9": 395,
    "Fadd11": 396,
    "Dmadd11": 397,
    "A11sus4": 398,
    "Amaj9sus4": 399,
    "G#unk[6]": 400,
    "C13": 401,
    "G#augMaj7": 402,
    "Amaj7sus4": 403,
    "Eadd9sus2": 404,
    "Badd13": 405,
    "Eunk[empty]": 406,
    "Dunk[4,2]": 407,
    "A#madd11": 408,
    "DaugMaj7": 409,
    "G#mMaj7": 410,
    "C#11sus4": 411,
    "Fadd9sus2": 412,
    "Dunk[1,5,4]": 413,
    "A#add9sus2": 414,
    "G#maj7sus4": 415,
    "G#unk[1,5,4]": 416,
    "Gmaj11": 417,
    "A#mMaj7": 418,
    "A#11sus4": 419,
    "C#mMaj7": 420,
    "G#unk[10]": 421,
    "F#75": 422,
    "F#add9sus2": 423,
    "F75": 424,
    "Dmaj11": 425,
    "Gunk[1,5,4]": 426,
    "F#mMaj7": 427,
    "G#unk[4,2,4]": 428,
    "F11sus4": 429,
    "A#unk[4]": 430,
    "G13b9": 431,
    "A#13sus4": 432,
    "Gunk[4,7]": 433,
    "Aunk[5,1,4]": 434,
    "Emaj7sus4": 435,
    "C#unk[5,1]": 436,
    "A#unk[1,5]": 437,
    "D#unk[5,1,4]": 438,
    "F#maj7sus4": 439,
    "D#75": 440,
    "C#9#11": 441,
    "A13sus4": 442,
    "Gunk[4]": 443,
    "Bunk[3]": 444,
    "D#add13": 445,
    "F#unk[11]": 446,
    "C#unk[3,7]": 447,
    "EaugMaj7": 448,
    "G#add9sus2": 449,
    "Funk[5,1,4]": 450,
    "Eunk[5,1]": 451,
    "Fmaj11": 452,
    "Aunk[1,5,4]": 453,
    "F#augMaj7": 454,
    "C#augMaj7": 455,
    "D#madd11": 456,
    "Cunk[4]": 457,
    "A#7b9": 458,
    "Aunk[4,2]": 459,
    "Dm13": 460,
    "Gunk[4,2,4]": 461,
    "Dunk[3,7]": 462,
    "A#unk[2,3,5]": 463,
    "D#aug7": 464,
    "Eunk[4,6,4]": 465,
    "D#11sus4": 466,
    "Eunk[3,5]": 467,
    "C#add9sus2": 468,
    "Bunk[5,1,4]": 469,
    "A#maj7sus4": 470,
    "Emaj11": 471,
    "C#add13": 472,
    "BaugMaj7": 473,
    "Bunk[3,7]": 474,
    "EmMaj7": 475,
    "Dunk[4]": 476,
    "Funk[11]": 477,
    "A#unk[4,7]": 478,
    "G#unk[3,7]": 479,
    "Gunk[4,2]": 480,
    "Emaj9sus4": 481,
    "F#11sus4": 482,
    "Eunk[5,1,4]": 483,
    "A75": 484,
    "D#add9sus2": 485,
    "C#75": 486,
    "Bmaj7sus4": 487,
    "Cunk[1,5,4]": 488,
    "Eunk[1,5,4]": 489,
    "Aunk[3,7]": 490,
    "Dunk[5,5]": 491,
    "G13sus4": 492,
    "Aunk[3,5,2]": 493,
    "Cunk[4,2,5]": 494,
    "Cmadd11add9": 495,
    "G#unk[8]": 496,
    "A#add11": 497,
    "Aunk[5]": 498,
    "Aadd11add9": 499,
    "Fmadd11": 500,
    "A#unk[1,3,2]": 501,
    "Dmaj9sus4": 502,
    "Aunk[3,5,3]": 503,
    "Cmaj7sus4": 504,
    "Bunk[5,1]": 505,
    "Amaj11": 506,
    "D#unk[1,5,4]": 507,
    "C#unk[6,4]": 508,
    "D#unk[4,2,4]": 509,
    "C#13b9": 510,
    "AaugMaj7": 511,
    "Bunk[4,2,4]": 512,
    "Cmadd11": 513,
    "Bunk[5,5]": 514,
    "Dunk[4,7,3]": 515,
    "Cmaj13": 516,
    "Fmaj9sus4": 517,
    "F#unk[4,2]": 518,
    "Daug9": 519,
    "C13sus4": 520,
    "Eunk[3,7]": 521,
    "C#7#11": 522,
    "F#unk[4,2,4]": 523,
    "Eunk[4,6]": 524,
    "D13sus4": 525,
    "E13sus4": 526,
    "F#13sus4": 527,
    "Cadd11add9": 528,
    "G#7#11": 529,
    "F#maj9sus4": 530,
    "C#unk[1,4,1,4,11]": 531,
    "C#unk[3,5,2]": 532,
    "Eunk[10,3,4]": 533,
    "Aadd11sus4": 534,
    "Dunk[5,1,4]": 535,
    "D#maj11": 536,
    "F#unk[1,5,3]": 537,
    "G#75": 538,
    "G#unk[4,6]": 539,
    "E9#11": 540,
    "A#9#11": 541,
    "C#unk[4,2,4,4]": 542,
    "F#unk[5,1,4]": 543,
    "F#unk[1,5,4]": 544,
    "Cunk[4,6]": 545,
    "Aunk[4,6]": 546,
    "G#add11": 547,
    "A#7#11": 548,
    "Cunk[3,7]": 549,
    "Eunk[4]": 550,
    "Aunk[4,10]": 551,
    "G#madd11": 552,
    "Aunk[14,3]": 553,
    "Gunk[11]": 554,
    "Cunk[4,2,4]": 555,
    "F#unk[3,2]": 556,
    "F#unk[3]": 557,
    "Gaug9": 558,
    "Gmadd11add9": 559,
    "D#13sus4": 560,
    "Gmaj9sus4": 561,
    "G7#11": 562,
    "Cunk[3]": 563,
    "C#unk[1,5,3]": 564,
    "Amadd11add9": 565,
    "A#unk[4,2]": 566,
    "F#7#11": 567,
    "G#unk[4,2]": 568,
    "Aunk[4,2,4,3]": 569,
    "Eunk[4,2,4]": 570,
    "A9#11": 571,
    "Aunk[4,2,8]": 572,
    "G#unk[4,2,5]": 573,
    "Bunk[4,13]": 574,
    "Cunk[6]": 575,
    "A#unk[5,3]": 576,
    "Dunk[1,5]": 577,
    "A#unk[1,5,4]": 578,
    "C#maj7sus4": 579,
    "Cunk[1,5]": 580,
    "Fmaj7sus4": 581,
    "A#75": 582,
    "C#unk[4,2,4]": 583,
    "Cunk[4,2]": 584,
    "Bunk[4,6]": 585,
    "D#madd11add9": 586,
    "Bunk[6,1,4,10]": 587,
    "Aunk[7,3,4,3,4]": 588,
    "C13b9": 589,
    "F#unk[4,2,5]": 590,
    "D#unk[3,6]": 591,
    "Bunk[4]": 592,
    "F#add13": 593,
    "Bunk[14,3]": 594,
    "Gmaj13": 595,
    "Eunk[6]": 596,
    "Bunk[4,2]": 597,
    "Eunk[3,2]": 598,
    "Dunk[3,5,2]": 599,
    "Funk[3,5,2]": 600,
    "D#add11add9": 601,
    "Fadd11sus4": 602,
    "Bunk[3,6]": 603,
    "Aadd13add11add9": 604,
    "Dunk[3,5]": 605,
    "D#9#11": 606,
    "F#unk[3,7,10]": 607,
    "D#7#11": 608,
    "Eunk[4,3,3,5,2,4]": 609,
    "A#maj9sus4": 610,
    "Dunk[5,2,4,10]": 611,
    "C#unk[3,6]": 612,
    "Funk[5,3,2]": 613,
    "C#unk[4,10,7]": 614,
    "C#unk[5,5]": 615,
    "Dunk[5,3,13]": 616,
    "C#unk[3,7,4]": 617,
    "Aunk[10,4,3]": 618,
    "A#unk[5,1]": 619,
    "Eadd11sus4": 620,
    "Dunk[5,1]": 621,
    "Gunk[5,1,4]": 622,
    "G#unk[1,4,1]": 623,
    "Aunk[1,5]": 624,
    "Eunk[1,5,3]": 625,
    "D11b9": 626,
    "AmMaj9": 627,
    "F#unk[3,5]": 628,
    "Bunk[4,2,4,4]": 629,
    "D#mMaj9": 630,
    "D#unk[4,2,4,4]": 631,
    "Dadd11sus4": 632,
    "B13b9": 633,
    "D#unk[4]": 634,
    "Eunk[3,3,10]": 635,
    "Cunk[3,5,2]": 636,
    "A#unk[3,5,2]": 637,
    "A13#11": 638,
    "F#unk[5,3,3,2]": 639,
    "Aunk[4]": 640,
    "Eunk[3,5,2]": 641,
    "Amaj13": 642,
    "C#unk[6]": 643,
    "D#unk[6,4,3]": 644,
    "Funk[4,4,13]": 645,
    "D#unk[14,7]": 646,
    "D#unk[11,10]": 647,
    "Dunk[14,7]": 648,
    "Fmaj13": 649,
    "G#unk[6,2,3]": 650,
    "E7#11": 651,
    "Gunk[2]": 652,
    "Gunk[3,4,3,4,7]": 653,
    "Gunk[4,6]": 654,
    "Dunk[4,3,4,4,5]": 655,
    "Funk[4,2,15]": 656,
    "F#unk[3,6]": 657,
    "Gunk[3,5,13]": 658,
    "Aunk[4,6,3]": 659,
    "F#unk[6,4]": 660,
    "G#unk[2,4,4]": 661,
    "Badd11add9": 662,
    "Funk[4,3,4,2]": 663,
    "C#unk[3]": 664,
    "F13b9": 665,
    "D#unk[2,4,1,4,10]": 666,
    "Eunk[3,4,6,4]": 667,
    "Gunk[5,6,10]": 668,
    "G#unk[1,5,3]": 669,
    "G#unk[5,1,5]": 670,
    "D7b9#11": 671,
    "Funk[4,3,3,7,4]": 672,
    "Bunk[5,3,3]": 673,
    "Dunk[6,4]": 674,
    "G#unk[4,3,4,4]": 675,
    "Dunk[4,7]": 676,
    "Bunk[1,5,3]": 677,
    "CmMaj9": 678,
    "Gunk[4,2,4,3]": 679,
    "FmMaj9": 680,
    "G#13sus4": 681,
    "C#unk[6,3]": 682,
    "G#unk[4,3,3,5,3]": 683,
    "Gunk[4,2,5,2,4,4]": 684,
    "Gunk[2,4]": 685,
    "Funk[2,5,4,7]": 686,
    "Bmaj13": 687,
    "G#9#11": 688,
    "F#unk[3,7]": 689,
    "Gadd11sus4": 690,
    "C#unk[2,3,5]": 691,
    "Badd11sus4": 692,
    "B7#11": 693,
    "A#13b9": 694,
    "Funk[4,2,4,3]": 695,
    "D#unk[2,4,4]": 696,
    "Dmadd11add9": 697,
    "Eunk[4,2]": 698,
    "Cunk[2,3,2,4,10]": 699,
    "D7#11": 700,
    "D#13b9": 701,
    "F#unk[2,5,3,8]": 702,
    "Fmadd11add9": 703,
    "G#unk[2,5,4,9]": 704,
    "Eunk[3,7,7]": 705,
    "Eunk[7,3,7,4]": 706,
    "A#unk[6]": 707,
    "Eunk[2,6,3]": 708,
    "Cunk[4,3,7,4,3]": 709,
    "B13sus4": 710,
    "C9#11": 711,
    "A7#11": 712,
    "G#11b9": 713,
    "C#unk[4,2]": 714,
    "Bunk[2,5,3,4,3]": 715,
    "G#unk[3,6]": 716,
    "A#unk[3,6]": 717,
    "C#unk[6,4,10]": 718,
    "Eadd13add11add9": 719,
    "Cunk[4,3,3,8,3]": 720,
    "C#madd11add9": 721,
    "Dunk[6,4,3]": 722,
    "A#add11sus4": 723,
    "C#unk[4,2,5]": 724,
    "Eunk[3,7,4]": 725,
    "Cunk[2,3,2,14]": 726,
    "Cunk[4,17]": 727,
    "F#unk[4,6,11]": 728,
    "Cunk[2]": 729,
    "G#unk[3,5]": 730,
    "C#unk[3,5,2,7]": 731,
    "Funk[6]": 732,
    "Dunk[4,3,13]": 733,
    "A#unk[3]": 734,
    "Cunk[4,2,5,10]": 735,
    "Aunk[6,4,3]": 736,
    "Aunk[4,7,10]": 737,
    "Cunk[5,3]": 738,
    "Eunk[5]": 739,
    "Aunk[3,3,7,7]": 740,
    "F#unk[4,2,8,7]": 741,
    "Funk[11,3,3]": 742,
    "Bunk[3,3,4,3,4,3]": 743,
    "Dunk[3,7,4,3]": 744
  },
  "idx2chord": {
    "0": "<PAD>",
    "1": "<UNK>",
    "2": "G",
    "3": "C",
    "4": "D",
    "5": "F",
    "6": "A",
    "7": "E",
    "8": "A#",
    "9": "D#",
    "10": "Am",
    "11": "G#",
    "12": "B",
    "13": "Em",
    "14": "C#",
    "15": "Dm",
    "16": "F#",
    "17": "Cm",
    "18": "Bm",
    "19": "Gm",
    "20": "F#m",
    "21": "Fm",
    "22": "C#m",
    "23": "D#m",
    "24": "G#m",
    "25": "A#m",
    "26": "Am7",
    "27": "Em7",
    "28": "Dm7",
    "29": "Gm7",
    "30": "Bm7",
    "31": "Cm7",
    "32": "F#m7",
    "33": "Fm7",
    "34": "C#m7",
    "35": "G7",
    "36": "Fmaj7",
    "37": "D7",
    "38": "Cmaj7",
    "39": "C7",
    "40": "A#m7",
    "41": "A7",
    "42": "D#m7",
    "43": "G#maj7",
    "44": "G#m7",
    "45": "Dmaj7",
    "46": "Gmaj7",
    "47": "E7",
    "48": "B7",
    "49": "F7",
    "50": "A#7",
    "51": "D#maj7",
    "52": "A#maj7",
    "53": "Amaj7",
    "54": "G#7",
    "55": "Bmaj7",
    "56": "F#maj7",
    "57": "C#maj7",
    "58": "Emaj7",
    "59": "D#7",
    "60": "C#7",
    "61": "F#7",
    "62": "Cadd9",
    "63": "Gsus4",
    "64": "Dsus4",
    "65": "Asus4",
    "66": "Dadd9",
    "67": "Fadd9",
    "68": "Bdim",
    "69": "C#dim",
    "70": "Ddim",
    "71": "Aadd9",
    "72": "Edim",
    "73": "F#dim",
    "74": "Gadd9",
    "75": "Csus4",
    "76": "Fsus4",
    "77": "G#dim",
    "78": "Esus4",
    "79": "G#add9",
    "80": "C#sus4",
    "81": "D#dim",
    "82": "D#add9",
    "83": "Badd9",
    "84": "A#sus4",
    "85": "A#add9",
    "86": "Bsus4",
    "87": "Cdim",
    "88": "Gdim",
    "89": "G#sus4",
    "90": "C#add9",
    "91": "Dm7b5",
    "92": "Em7b5",
    "93": "Asus2",
    "94": "Bm7b5",
    "95": "F#m7b5",
    "96": "Adim",
    "97": "Esus2",
    "98": "Fdim",
    "99": "A#dim",
    "100": "D#sus4",
    "101": "Eadd9",
    "102": "Csus2",
    "103": "Am7b5",
    "104": "Dsus2",
    "105": "Bsus2",
    "106": "Gsus2",
    "107": "Fsus2",
    "108": "G7sus4",
    "109": "F#sus4",
    "110": "F#add9",
    "111": "D#m7b5",
    "112": "D#sus2",
    "113": "A#sus2",
    "114": "C#m7b5",
    "115": "C#sus2",
    "116": "C5",
    "117": "Amadd9",
    "118": "D7sus4",
    "119": "Cmaj9",
    "120": "Gm7b5",
    "121": "A7sus4",
    "122": "C7sus4",
    "123": "Fm7b5",
    "124": "Em9",
    "125": "Gmadd9",
    "126": "D9sus2",
    "127": "D#7sus4",
    "128": "A#m7b5",
    "129": "G11",
    "130": "A#7sus4",
    "131": "B7sus4",
    "132": "G#m7b5",
    "133": "Cm7b5",
    "134": "D#maj9",
    "135": "E7sus4",
    "136": "Fm9",
    "137": "G5",
    "138": "C11",
    "139": "D#m9",
    "140": "Am9",
    "141": "Gm9",
    "142": "G#7sus4",
    "143": "G#sus2",
    "144": "Fmaj9",
    "145": "F#madd9",
    "146": "E9sus2",
    "147": "A11",
    "148": "F#sus2",
    "149": "Dmadd9",
    "150": "Gmaj9",
    "151": "D11",
    "152": "A#madd9",
    "153": "C#maj9",
    "154": "C9sus2",
    "155": "Cm9",
    "156": "E11",
    "157": "Dm11",
    "158": "Fmaj9sus2",
    "159": "F#7sus4",
    "160": "Dmaj9",
    "161": "Dm9",
    "162": "Fmadd9",
    "163": "Emaj9",
    "164": "Cmadd9",
    "165": "F#m9",
    "166": "F7sus4",
    "167": "F#dim7",
    "168": "F#m11",
    "169": "Cm11",
    "170": "D#9sus2",
    "171": "C#7sus4",
    "172": "Am11",
    "173": "Bm11",
    "174": "Amaj9",
    "175": "Em11",
    "176": "G#m9",
    "177": "Dmaj9sus2",
    "178": "Cmaj9sus2",
    "179": "G#maj9",
    "180": "D#madd9",
    "181": "A9sus2",
    "182": "Bdim7",
    "183": "A#11",
    "184": "Edim7",
    "185": "D#maj9sus2",
    "186": "C9",
    "187": "A#m9",
    "188": "C#dim7",
    "189": "B11",
    "190": "F5",
    "191": "Fm11",
    "192": "A#maj9",
    "193": "A#9sus2",
    "194": "C#m9",
    "195": "D9",
    "196": "F#maj9",
    "197": "Bmadd9",
    "198": "C#9sus2",
    "199": "G9sus2",
    "200": "D#11",
    "201": "G#dim7",
    "202": "E5",
    "203": "C#11",
    "204": "F11",
    "205": "G#9sus2",
    "206": "D#dim7",
    "207": "F9sus2",
    "208": "B9sus2",
    "209": "Emadd9",
    "210": "Dadd9sus4",
    "211": "Gmaj9sus2",
    "212": "Adim7",
    "213": "C#m11",
    "214": "F9",
    "215": "Cunk[empty]",
    "216": "G#madd9",
    "217": "Gadd9sus4",
    "218": "Bm9",
    "219": "C#madd9",
    "220": "A#maj9sus2",
    "221": "A5",
    "222": "Cadd9sus4",
    "223": "A#dim7",
    "224": "Amaj9sus2",
    "225": "Gm11",
    "226": "D#m11",
    "227": "G#11",
    "228": "Bmaj9",
    "229": "A#m11",
    "230": "Caug",
    "231": "D#9",
    "232": "G9",
    "233": "Gdim7",
    "234": "D5",
    "235": "Fadd9sus4",
    "236": "Ddim7",
    "237": "Fdim7",
    "238": "F#9sus2",
    "239": "Aadd9sus4",
    "240": "Eadd9sus4",
    "241": "B5",
    "242": "Emaj9sus2",
    "243": "D#5",
    "244": "Cdim7",
    "245": "A9",
    "246": "F#maj9sus2",
    "247": "A#add9sus4",
    "248": "C#add9sus4",
    "249": "G#maj9sus2",
    "250": "Bmaj9sus2",
    "251": "E9",
    "252": "A#9",
    "253": "Baug7",
    "254": "Gaug",
    "255": "C#maj9sus2",
    "256": "B9",
    "257": "A13",
    "258": "Faug",
    "259": "Daug",
    "260": "Aaug7",
    "261": "Funk[empty]",
    "262": "A#5",
    "263": "D7b9",
    "264": "Bunk[empty]",
    "265": "E7b9",
    "266": "Badd9sus4",
    "267": "F#11",
    "268": "A#13",
    "269": "F#aug",
    "270": "A#unk[empty]",
    "271": "C#5",
    "272": "Gaug7",
    "273": "F#add9sus4",
    "274": "G#5",
    "275": "D#aug",
    "276": "C11sus4",
    "277": "Eaug",
    "278": "Gadd13",
    "279": "Faug7",
    "280": "Aadd11",
    "281": "D#add9sus4",
    "282": "G13",
    "283": "Eadd13",
    "284": "A7b9",
    "285": "Eaug7",
    "286": "AmMaj7",
    "287": "F#aug7",
    "288": "E75",
    "289": "Gadd9sus2",
    "290": "G#m11",
    "291": "Dadd13",
    "292": "Dunk[empty]",
    "293": "Gunk[5]",
    "294": "DmMaj7",
    "295": "C#9",
    "296": "G#aug",
    "297": "Aaug",
    "298": "Cunk[5]",
    "299": "G#unk[empty]",
    "300": "A#aug7",
    "301": "B7b9",
    "302": "Baug",
    "303": "Caug7",
    "304": "B13",
    "305": "D#unk[4,6]",
    "306": "F#5",
    "307": "Cmaj11",
    "308": "C7b9",
    "309": "Cadd11",
    "310": "C#aug",
    "311": "G#add9sus4",
    "312": "Aadd9sus2",
    "313": "B75",
    "314": "Cadd9sus2",
    "315": "C#add11",
    "316": "Dunk[4,2,4]",
    "317": "F13",
    "318": "Fadd13",
    "319": "F#madd11",
    "320": "G75",
    "321": "Bunk[1,5,4]",
    "322": "Daug7",
    "323": "G7b9",
    "324": "Dadd11",
    "325": "FaugMaj7",
    "326": "CmMaj7",
    "327": "Eadd11",
    "328": "Cunk[6,2]",
    "329": "Badd9sus2",
    "330": "Aadd13",
    "331": "Cadd13",
    "332": "Emadd11",
    "333": "D75",
    "334": "G#9",
    "335": "B11sus4",
    "336": "GaugMaj7",
    "337": "Gunk[3]",
    "338": "CaugMaj7",
    "339": "Gunk[empty]",
    "340": "Funk[1,5,4]",
    "341": "Dmaj7sus4",
    "342": "A#aug",
    "343": "F#13",
    "344": "G#13",
    "345": "Funk[4,6]",
    "346": "D#add11",
    "347": "Gadd11",
    "348": "D#maj7sus4",
    "349": "F#9",
    "350": "A#add13",
    "351": "Aunk[empty]",
    "352": "C#unk[empty]",
    "353": "Amadd11",
    "354": "Bmadd11",
    "355": "FmMaj7",
    "356": "Gmadd11",
    "357": "G11sus4",
    "358": "BmMaj7",
    "359": "F#7b9",
    "360": "Aunk[4,2,4]",
    "361": "D#unk[empty]",
    "362": "C#unk[4,17]",
    "363": "Eunk[3]",
    "364": "A#augMaj7",
    "365": "C#aug7",
    "366": "D#13",
    "367": "Badd11",
    "368": "Dadd9sus2",
    "369": "D#mMaj7",
    "370": "F#unk[empty]",
    "371": "C#7b9",
    "372": "F#unk[5,1]",
    "373": "D11sus4",
    "374": "D#7b9",
    "375": "G#add13",
    "376": "GmMaj7",
    "377": "G#aug7",
    "378": "C#13",
    "379": "F#unk[4,17]",
    "380": "Aunk[3]",
    "381": "Dunk[3]",
    "382": "C#madd11",
    "383": "G#11sus4",
    "384": "F#add11",
    "385": "D#augMaj7",
    "386": "D13",
    "387": "E13",
    "388": "F7#11",
    "389": "E11sus4",
    "390": "Gmaj7sus4",
    "391": "C75",
    "392": "F7b9",
    "393": "Funk[4]",
    "394": "Cmaj9sus4",
    "395": "G#7b9",
    "396": "Fadd11",
    "397": "Dmadd11",
    "398": "A11sus4",
    "399": "Amaj9sus4",
    "400": "G#unk[6]",
    "401": "C13",
    "402": "G#augMaj7",
    "403": "Amaj7sus4",
    "404": "Eadd9sus2",
    "405": "Badd13",
    "406": "Eunk[empty]",
    "407": "Dunk[4,2]",
    "408": "A#madd11",
    "409": "DaugMaj7",
    "410": "G#mMaj7",
    "411": "C#11sus4",
    "412": "Fadd9sus2",
    "413": "Dunk[1,5,4]",
    "414": "A#add9sus2",
    "415": "G#maj7sus4",
    "416": "G#unk[1,5,4]",
    "417": "Gmaj11",
    "418": "A#mMaj7",
    "419": "A#11sus4",
    "420": "C#mMaj7",
    "421": "G#unk[10]",
    "422": "F#75",
    "423": "F#add9sus2",
    "424": "F75",
    "425": "Dmaj11",
    "426": "Gunk[1,5,4]",
    "427": "F#mMaj7",
    "428": "G#unk[4,2,4]",
    "429": "F11sus4",
    "430": "A#unk[4]",
    "431": "G13b9",
    "432": "A#13sus4",
    "433": "Gunk[4,7]",
    "434": "Aunk[5,1,4]",
    "435": "Emaj7sus4",
    "436": "C#unk[5,1]",
    "437": "A#unk[1,5]",
    "438": "D#unk[5,1,4]",
    "439": "F#maj7sus4",
    "440": "D#75",
    "441": "C#9#11",
    "442": "A13sus4",
    "443": "Gunk[4]",
    "444": "Bunk[3]",
    "445": "D#add13",
    "446": "F#unk[11]",
    "447": "C#unk[3,7]",
    "448": "EaugMaj7",
    "449": "G#add9sus2",
    "450": "Funk[5,1,4]",
    "451": "Eunk[5,1]",
    "452": "Fmaj11",
    "453": "Aunk[1,5,4]",
    "454": "F#augMaj7",
    "455": "C#augMaj7",
    "456": "D#madd11",
    "457": "Cunk[4]",
    "458": "A#7b9",
    "459": "Aunk[4,2]",
    "460": "Dm13",
    "461": "Gunk[4,2,4]",
    "462": "Dunk[3,7]",
    "463": "A#unk[2,3,5]",
    "464": "D#aug7",
    "465": "Eunk[4,6,4]",
    "466": "D#11sus4",
    "467": "Eunk[3,5]",
    "468": "C#add9sus2",
    "469": "Bunk[5,1,4]",
    "470": "A#maj7sus4",
    "471": "Emaj11",
    "472": "C#add13",
    "473": "BaugMaj7",
    "474": "Bunk[3,7]",
    "475": "EmMaj7",
    "476": "Dunk[4]",
    "477": "Funk[11]",
    "478": "A#unk[4,7]",
    "479": "G#unk[3,7]",
    "480": "Gunk[4,2]",
    "481": "Emaj9sus4",
    "482": "F#11sus4",
    "483": "Eunk[5,1,4]",
    "484": "A75",
    "485": "D#add9sus2",
    "486": "C#75",
    "487": "Bmaj7sus4",
    "488": "Cunk[1,5,4]",
    "489": "Eunk[1,5,4]",
    "490": "Aunk[3,7]",
    "491": "Dunk[5,5]",
    "492": "G13sus4",
    "493": "Aunk[3,5,2]",
    "494": "Cunk[4,2,5]",
    "495": "Cmadd11add9",
    "496": "G#unk[8]",
    "497": "A#add11",
    "498": "Aunk[5]",
    "499": "Aadd11add9",
    "500": "Fmadd11",
    "501": "A#unk[1,3,2]",
    "502": "Dmaj9sus4",
    "503": "Aunk[3,5,3]",
    "504": "Cmaj7sus4",
    "505": "Bunk[5,1]",
    "506": "Amaj11",
    "507": "D#unk[1,5,4]",
    "508": "C#unk[6,4]",
    "509": "D#unk[4,2,4]",
    "510": "C#13b9",
    "511": "AaugMaj7",
    "512": "Bunk[4,2,4]",
    "513": "Cmadd11",
    "514": "Bunk[5,5]",
    "515": "Dunk[4,7,3]",
    "516": "Cmaj13",
    "517": "Fmaj9sus4",
    "518": "F#unk[4,2]",
    "519": "Daug9",
    "520": "C13sus4",
    "521": "Eunk[3,7]",
    "522": "C#7#11",
    "523": "F#unk[4,2,4]",
    "524": "Eunk[4,6]",
    "525": "D13sus4",
    "526": "E13sus4",
    "527": "F#13sus4",
    "528": "Cadd11add9",
    "529": "G#7#11",
    "530": "F#maj9sus4",
    "531": "C#unk[1,4,1,4,11]",
    "532": "C#unk[3,5,2]",
    "533": "Eunk[10,3,4]",
    "534": "Aadd11sus4",
    "535": "Dunk[5,1,4]",
    "536": "D#maj11",
    "537": "F#unk[1,5,3]",
    "538": "G#75",
    "539": "G#unk[4,6]",
    "540": "E9#11",
    "541": "A#9#11",
    "542": "C#unk[4,2,4,4]",
    "543": "F#unk[5,1,4]",
    "544": "F#unk[1,5,4]",
    "545": "Cunk[4,6]",
    "546": "Aunk[4,6]",
    "547": "G#add11",
    "548": "A#7#11",
    "549": "Cunk[3,7]",
    "550": "Eunk[4]",
    "551": "Aunk[4,10]",
    "552": "G#madd11",
    "553": "Aunk[14,3]",
    "554": "Gunk[11]",
    "555": "Cunk[4,2,4]",
    "556": "F#unk[3,2]",
    "557": "F#unk[3]",
    "558": "Gaug9",
    "559": "Gmadd11add9",
    "560": "D#13sus4",
    "561": "Gmaj9sus4",
    "562": "G7#11",
    "563": "Cunk[3]",
    "564": "C#unk[1,5,3]",
    "565": "Amadd11add9",
    "566": "A#unk[4,2]",
    "567": "F#7#11",
    "568": "G#unk[4,2]",
    "569": "Aunk[4,2,4,3]",
    "570": "Eunk[4,2,4]",
    "571": "A9#11",
    "572": "Aunk[4,2,8]",
    "573": "G#unk[4,2,5]",
    "574": "Bunk[4,13]",
    "575": "Cunk[6]",
    "576": "A#unk[5,3]",
    "577": "Dunk[1,5]",
    "578": "A#unk[1,5,4]",
    "579": "C#maj7sus4",
    "580": "Cunk[1,5]",
    "581": "Fmaj7sus4",
    "582": "A#75",
    "583": "C#unk[4,2,4]",
    "584": "Cunk[4,2]",
    "585": "Bunk[4,6]",
    "586": "D#madd11add9",
    "587": "Bunk[6,1,4,10]",
    "588": "Aunk[7,3,4,3,4]",
    "589": "C13b9",
    "590": "F#unk[4,2,5]",
    "591": "D#unk[3,6]",
    "592": "Bunk[4]",
    "593": "F#add13",
    "594": "Bunk[14,3]",
    "595": "Gmaj13",
    "596": "Eunk[6]",
    "597": "Bunk[4,2]",
    "598": "Eunk[3,2]",
    "599": "Dunk[3,5,2]",
    "600": "Funk[3,5,2]",
    "601": "D#add11add9",
    "602": "Fadd11sus4",
    "603": "Bunk[3,6]",
    "604": "Aadd13add11add9",
    "605": "Dunk[3,5]",
    "606": "D#9#11",
    "607": "F#unk[3,7,10]",
    "608": "D#7#11",
    "609": "Eunk[4,3,3,5,2,4]",
    "610": "A#maj9sus4",
    "611": "Dunk[5,2,4,10]",
    "612": "C#unk[3,6]",
    "613": "Funk[5,3,2]",
    "614": "C#unk[4,10,7]",
    "615": "C#unk[5,5]",
    "616": "Dunk[5,3,13]",
    "617": "C#unk[3,7,4]",
    "618": "Aunk[10,4,3]",
    "619": "A#unk[5,1]",
    "620": "Eadd11sus4",
    "621": "Dunk[5,1]",
    "622": "Gunk[5,1,4]",
    "623": "G#unk[1,4,1]",
    "624": "Aunk[1,5]",
    "625": "Eunk[1,5,3]",
    "626": "D11b9",
    "627": "AmMaj9",
    "628": "F#unk[3,5]",
    "629": "Bunk[4,2,4,4]",
    "630": "D#mMaj9",
    "631": "D#unk[4,2,4,4]",
    "632": "Dadd11sus4",
    "633": "B13b9",
    "634": "D#unk[4]",
    "635": "Eunk[3,3,10]",
    "636": "Cunk[3,5,2]",
    "637": "A#unk[3,5,2]",
    "638": "A13#11",
    "639": "F#unk[5,3,3,2]",
    "640": "Aunk[4]",
    "641": "Eunk[3,5,2]",
    "642": "Amaj13",
    "643": "C#unk[6]",
    "644": "D#unk[6,4,3]",
    "645": "Funk[4,4,13]",
    "646": "D#unk[14,7]",
    "647": "D#unk[11,10]",
    "648": "Dunk[14,7]",
    "649": "Fmaj13",
    "650": "G#unk[6,2,3]",
    "651": "E7#11",
    "652": "Gunk[2]",
    "653": "Gunk[3,4,3,4,7]",
    "654": "Gunk[4,6]",
    "655": "Dunk[4,3,4,4,5]",
    "656": "Funk[4,2,15]",
    "657": "F#unk[3,6]",
    "658": "Gunk[3,5,13]",
    "659": "Aunk[4,6,3]",
    "660": "F#unk[6,4]",
    "661": "G#unk[2,4,4]",
    "662": "Badd11add9",
    "663": "Funk[4,3,4,2]",
    "664": "C#unk[3]",
    "665": "F13b9",
    "666": "D#unk[2,4,1,4,10]",
    "667": "Eunk[3,4,6,4]",
    "668": "Gunk[5,6,10]",
    "669": "G#unk[1,5,3]",
    "670": "G#unk[5,1,5]",
    "671": "D7b9#11",
    "672": "Funk[4,3,3,7,4]",
    "673": "Bunk[5,3,3]",
    "674": "Dunk[6,4]",
    "675": "G#unk[4,3,4,4]",
    "676": "Dunk[4,7]",
    "677": "Bunk[1,5,3]",
    "678": "CmMaj9",
    "679": "Gunk[4,2,4,3]",
    "680": "FmMaj9",
    "681": "G#13sus4",
    "682": "C#unk[6,3]",
    "683": "G#unk[4,3,3,5,3]",
    "684": "Gunk[4,2,5,2,4,4]",
    "685": "Gunk[2,4]",
    "686": "Funk[2,5,4,7]",
    "687": "Bmaj13",
    "688": "G#9#11",
    "689": "F#unk[3,7]",
    "690": "Gadd11sus4",
    "691": "C#unk[2,3,5]",
    "692": "Badd11sus4",
    "693": "B7#11",
    "694": "A#13b9",
    "695": "Funk[4,2,4,3]",
    "696": "D#unk[2,4,4]",
    "697": "Dmadd11add9",
    "698": "Eunk[4,2]",
    "699": "Cunk[2,3,2,4,10]",
    "700": "D7#11",
    "701": "D#13b9",
    "702": "F#unk[2,5,3,8]",
    "703": "Fmadd11add9",
    "704": "G#unk[2,5,4,9]",
    "705": "Eunk[3,7,7]",
    "706": "Eunk[7,3,7,4]",
    "707": "A#unk[6]",
    "708": "Eunk[2,6,3]",
    "709": "Cunk[4,3,7,4,3]",
    "710": "B13sus4",
    "711": "C9#11",
    "712": "A7#11",
    "713": "G#11b9",
    "714": "C#unk[4,2]",
    "715": "Bunk[2,5,3,4,3]",
    "716": "G#unk[3,6]",
    "717": "A#unk[3,6]",
    "718": "C#unk[6,4,10]",
    "719": "Eadd13add11add9",
    "720": "Cunk[4,3,3,8,3]",
    "721": "C#madd11add9",
    "722": "Dunk[6,4,3]",
    "723": "A#add11sus4",
    "724": "C#unk[4,2,5]",
    "725": "Eunk[3,7,4]",
    "726": "Cunk[2,3,2,14]",
    "727": "Cunk[4,17]",
    "728": "F#unk[4,6,11]",
    "729": "Cunk[2]",
    "730": "G#unk[3,5]",
    "731": "C#unk[3,5,2,7]",
    "732": "Funk[6]",
    "733": "Dunk[4,3,13]",
    "734": "A#unk[3]",
    "735": "Cunk[4,2,5,10]",
    "736": "Aunk[6,4,3]",
    "737": "Aunk[4,7,10]",
    "738": "Cunk[5,3]",
    "739": "Eunk[5]",
    "740": "Aunk[3,3,7,7]",
    "741": "F#unk[4,2,8,7]",
    "742": "Funk[11,3,3]",
    "743": "Bunk[3,3,4,3,4,3]",
    "744": "Dunk[3,7,4,3]"
  }
}